[
    {
        "title": "U.S. Bank Mobile Banking",
        "appId": "com.usbank.mobilebanking",
        "developer": "U.S. Bank Mobile",
        "icon": "https://play-lh.googleusercontent.com/R0odPLUnFbG0n0MLUTrE_Xbn8b-O7D40RtFG5KlTta4ARrhAtvBgHpblHNGXS8tfhtH5",
        "description": "Security at your fingertips\r\n• Log in with your credentials for digital services at usbank.com. Don’t have online access? Enroll with the app. • Be alerted to duplicate charges, suspicious activity, and low balances. \r\nManage accounts and cards\r\n• View accounts & balances in one spot: checking, savings, credit cards, loans, and more. • Securely access credit scores.\r\n• Set travel notifications, lock & unlock cards, and more.\r\n• Add cards to mobile wallet.\r\n• Select your language preference – English or Spanish. \r\nPersonalized Insights\r\n• Review monthly spending in key categories, like Food & Dining.\r\n• Get recommendations on how to save and grow your money based on your spending history. \r\nU.S. Bank Smart Assistant®\r\n• Manage accounts by asking \"What’s the routing number for my checking account?\" • Move money by saying “Transfer $50 from checking to savings.” \r\nEasy money movement\r\n• Send & request money with friends and family using Zelle®2. • Quickly deposit checks, now with increased limits.\r\n• Pay & manage bills in one spot.\r\n• Make transfers between U.S. Bank accounts. \r\nExplore products\r\n• Find new accounts, credit cards, loans, small business accounts, & more. • Apply from the app and often get a decision within minutes. \r\nHelp when you need it \r\n• Explore the Help Center for answers to commonly asked questions.\r\n• View banking demos on Digital Explorer.\r\n• Schedule an appointment with a banker or get real-time support with Cobrowse. • Locate branches & ATMs near you. \r\nU.S. Bancorp Investments, an affiliate of U.S. Bank\r\n• View U.S. Bancorp Investments accounts & balances.\r\n• Make transfers between U.S. Bank accounts & U.S. Bancorp Investment accounts. \r\n1. Industry benchmarking firm Keynova Group ranked U.S. Bank #1 for mobile app in its Q3 2021 Mobile Banker Scorecard.\r\n2.Zelle and the Zelle related marks are wholly owned by Early Warning Services, LLC and are used herein under license. To send or receive money with Zelle®, both parties must have an eligible checking or savings account. Terms and conditions apply. \r\nU.S. Bank and U.S. Bancorp Investments is committed to protecting your privacy and security. Learn more by visiting U.S. Bank Consumer Privacy Pledge, the U.S. Bancorp Investments Privacy Pledge, and the Online Privacy and Security Policy. The Digital Security Guarantee | Mobile and online security | U.S. Bank (usbank.com) protects customers from fraud loss. For more information about U.S. Bank Mobile Banking, please visit usbank.com/mobile or call us toll-free at 800-685-5035. \r\nInvestment and insurance products and services including annuities are:\r\nNot a Deposit ● Not FDIC Insured ● May Lose Value ● Not Bank Guaranteed ● Not Insured by any Federal Government Agency\r\nFor U.S. Bank:\r\nEqual Housing Lender. Credit products offered by U.S. Bank National Association and subject to normal credit approval. Deposit products are offered by U.S. Bank National Association. Member FDIC.\r\nU.S. Bank is not responsible for and does not guarantee the products, services, or performance of U.S. Bancorp Investments.\r\nFor U.S. Bancorp Investments:\r\nInvestment and insurance products and services including annuities are available through U.S. Bancorp Investments, the marketing name for U.S. Bancorp Investments, Inc., member FINRA and SIPC, an investment adviser and a brokerage subsidiary of U.S. Bancorp and affiliate of U.S. Bank.",
        "url": "https://play.google.com/store/apps/details?id=com.usbank.mobilebanking",
        "score": 4.7100015,
        "ratings": 0,
        "installs": "10,000,000+"
    },
    {
        "title": "Chase Mobile",
        "appId": "com.chase.sig.android",
        "developer": "JPMorgan Chase",
        "icon": "https://play-lh.googleusercontent.com/nSkpJQa6V2cjC0JEgerrwner4IelIQzg06DZY8dtGwRsq6iXcrxCX2Iop_VI9pohvnI",
        "description": "Bank securely with the Chase Mobile® app: send and receive money with Zelle®, deposit checks, monitor credit score, budget and track income & spend. Use J.P. Morgan Wealth Management to plan, invest, & set and track long-terms goals with Wealth Plan. \r\n\r\nManage your accounts \r\n• Review account activity: checking, savings, credit card, home, auto & business \r\n• Deposit checks \r\n\r\nPayments: Convenient ways to pay \r\n• Send & receive money with Zelle® \r\n• Schedule and manage payments for your Chase credit card & other bills \r\n• Transfer money between accounts \r\n\r\nChase Credit Journey®: Get free credit score \r\n• Take control of your credit, know where you stand, & set score goals \r\n• Receive free identity monitoring to help keep your information safe \r\n\r\nBudget & Save \r\n• Daily insights at a glance \r\n• Budget & track debit/credit transactions \r\n\r\nSecurity: Keep your money safe & secure \r\n• We may notify you of unusual card purchases \r\n• Lock & unlock cards in the app \r\n\r\nPlan for your future and manage your investments \r\n• $0 online commission for equities, ETFs & options \r\n• Use J.P. Morgan Wealth Plan for goal setting and tracking \r\n• Schedule meetings with an advisor \r\n\r\nRewards, offers & deals \r\n• Track & redeem rewards \r\n• Earn statement credit by using Chase Offers with eligible credit/debit cards \r\n\r\nConnect with Chase \r\n• Schedule meetings with bankers \r\n• Find Chase branches & ATMs \r\n• Chat with representatives 24/7 \r\n\r\nChase QuickDeposit℠ is subject to deposit limits; funds are typically available by the next business day. Available on select mobile devices. See chase.com/QuickDeposit for T&Cs. Message and data rates may apply. Enrollment in Zelle® is required. Eligible account at participating U.S. financial institution required. T&Cs apply. Learn more at Chase.com/zelle. Zelle and the Zelle related marks are wholly owned by Early Warning Services, LLC and are used herein under license. \r\n• Some features are available for eligible customers and accounts only. Any time you review your balance, keep in mind it may not reflect all transactions including recent debit card transactions or checks you have written. \r\n• For illustrative purposes only—not intended as an endorsement or recommendation. \r\n• IMPORTANT: The projections or other information generated by Wealth Plan regarding the likelihood of various investment outcomes are hypothetical in nature, do not reflect actual investment results and are not guarantees of future results. Results may vary with each use and over time. \r\n• Commission-free online trades apply to trading in U.S. listed stocks, Exchange-Traded Funds (ETFs), and options. Option trades are subject to a $0.65 per-contract fee. Sales are subject to a regulatory transaction fee of between $0.01 and $0.03 per $1,000 of principal. There are costs associated with owning certain investments, including mutual funds and ETFs. Offer terms and pricing are subject to change and/or termination. Other fees and restrictions (including account types) apply. See chase.com/online-investing-pricing for terms and conditions. \r\n• Options contract and other fees may apply. \r\n• J.P. Morgan Wealth Management is a business of JPMorgan Chase & Co., which offers investment products and services through J.P. Morgan Securities LLC (JPMS), a registered broker-dealer and investment adviser, member of FINRA and SIPC. Insurance products are made available through Chase Insurance Agency, Inc. (CIA), a licensed insurance agency, doing business as Chase Insurance Agency Services, Inc. in Florida. Certain custody and other services are provided by JPMorgan Chase Bank, N.A. (JPMCB). JPMS, CIA and JPMCB are affiliated companies under the common control of JPMorgan Chase & Co. Products not available in all states. \r\nINVESTMENT PRODUCTS: \r\n• NOT A DEPOSIT \r\n• NOT FDIC INSURED \r\n• NO BANK GUARANTEE \r\n• MAY LOSE VALUE \r\n• Deposit products provided by JPMorgan Chase Bank, N.A. Member FDIC \r\n• Equal Opportunity Lender",
        "url": "https://play.google.com/store/apps/details?id=com.chase.sig.android",
        "score": 4.554311,
        "ratings": 0,
        "installs": "50,000,000+"
    },
    {
        "title": "Varo Bank: Online Banking",
        "appId": "com.varomoney.bank",
        "developer": "Varo Bank, N.A.",
        "icon": "https://play-lh.googleusercontent.com/Y9qby_gbA28uOibbLqaHH79K9Xt66sE8C6nFPtyUclPc5NniyXDO5x0ypo-dU9ebkDA",
        "description": "Varo isn’t just an online banking app. We are a real bank, built for the digital age. Accessible to you—with free online banking, early payday⁴, high yield savings³, credit score monitoring¹⁴, easy credit building⁷, automatic cashbackᵟ, instant cash advances (once qualified)⁵, and more. Fees apply to loans and out-of-network withdrawals/cash depositsᐞ.\r\n\r\nMember FDIC—mobile banking backed by the full faith and credit of the U.S. Government.\r\n\r\nFREE ONLINE BANKING\r\n• Early payday⁴\r\n• No minimums or hidden fees*\r\n• Free debit card\r\n• Free cash deposits at CVS®ᙾ and withdrawals at 40k+ in-network ATMs²\r\n• Free credit score monitoring¹⁴\r\n• Automatic cashback¹¹—no activation required or single-day windows\r\n• Mobile check deposit (quals apply)ᵟ\r\n• Track spend by category\r\n• Digital wallet (select customers)ᵟ\r\n• WE’RE A REAL BANK—unlike many money apps\r\n\r\nHIGH YIELD SAVINGS\r\n• Up to 5.00% APY, annual percentage yield, on balances up to $5,000 (quals apply)³\r\n• Receive 2.50% APY on remaining balances\r\n• Save money faster with automatic saving tools\r\n\r\nEASY CREDIT BUILDER\r\n• Free secured credit card for credit building⁷\r\n• No credit check, interest, annual fees, or min security deposit\r\n• Build credit by only spending what you have¹⁵\r\n• Track spend by category\r\n• Automatic payments available via Safe Pay¹⁶\r\n• Reported to Equifax, Experian, and TransUnion\r\n• Pre-existing credit scores saw a 40+ point increase on avg after 3 months of on-time payments⁸\r\n• 90% of users with no credit score had a score after one month¹⁷\r\n• Quals: Must have an active Varo Bank Account in good standing & incoming deposits of $200 or more in the past 31 days.\r\n\r\nINSTANT CASH ADVANCES\r\n• Borrow money instantly between $20 and $250, once qualified\r\n• Work your way up to $500 cash advances over time⁵\r\n• Cash advance funded directly into your online bank account\r\n• 30 days to repay (better than a payday advance)\r\n• One-time flat fee per cash advance\r\n• Automatic payments available for money advances¹⁸\r\n\r\nPERSONAL LINE OF CREDIT\r\n• Unsecured personal line of credit ranging from $600 to $2,000 (quals apply)¹⁰\r\n• No interest, late fees, or penalties\r\n• Simple flat fee structure\r\n• Personal loan funded instantly, once qualified\r\n• Money added to your online bank account\r\n• Credit line with affordable monthly payments\r\n• Payment periods between 3 and 12 months\r\n\r\nCASHBACK BONUS\r\n• New mobile banking customers get +50% cashback in their first 30 days with Varo!¹¹\r\n\r\nSEND MONEY\r\n• Send money to anybody, even if they aren’t a Varo customer\r\n• Transfer money using recipient’s phone number or email address\r\n• Fast, secure, and free!\r\n\r\nDOWNLOAD NOW!\r\n• Signup for an online bank account\r\n• Takes less than two minutes\r\n• No impact on your credit\r\n\r\n—\r\n\r\nDisclosures\r\n¹⁴ Varo displays credit data at our discretion to customers that opt in\r\n¹⁵ Your spending limit can’t exceed your available to spend balance in your Varo Believe Secured Account, up to $2,500 per day for purchases or $1,000 a day for cash advances, totaling no more than $10,000 total per billing cycle\r\n¹⁶ By enrolling in Safe Pay, you authorize Varo Bank to auto pay your Varo Believe Card balance in full at the end of your billing cycle from funds in your Varo Believe Secured Account, before your actual due date. If the amount owed is more then your Secured Account balance your payment will not be made. You will have twenty-one (21) days to deposit additional funds to make your payment on time\r\n¹⁷ As of November 14, 2024. Data based on comparison between VantageScore® 3.0 score from the initial pull after Believe card activation and the VantageScore® 3.0 score pulled after one month of reporting Believe Card activity. Individual results may vary\r\n¹⁸ Set up an automatic payment to your Varo Advance Account on any date you choose between 15 and 30 days from the day you get your Advance\r\nᐞ A full list of Varo fees can be found at https://www.varomoney.com/varo-fees\r\nᙾ See “Free Cash Deposits at CVS®” screenshot above\r\nᵟ Additional information: https://www.varomoney.com/disclosures/",
        "url": "https://play.google.com/store/apps/details?id=com.varomoney.bank",
        "score": 4.6122165,
        "ratings": 0,
        "installs": "5,000,000+"
    },
    {
        "title": "OnePay – Mobile Banking",
        "appId": "com.onefinance.one",
        "developer": "ONE Finance, Inc.",
        "icon": "https://play-lh.googleusercontent.com/-qm4Nb96TP3asz8PhKSwpEJxbj9dEPyLefku4hwMRvXu38xZFA5ctVboHvEg-zAcHFE",
        "description": "More. For your money.\r\n\r\nOnePay is a financial technology company, not a bank. Banking services provided by Coastal Community Bank or Lead Bank, Members FDIC. The OnePay CashRewards Mastercard is issued by Synchrony Bank pursuant to a license from Mastercard® International Incorporated. OnePay Debit Card is issued by banking partners Coastal Community Bank or Lead Bank, Members FDIC, pursuant to a license by Mastercard International Incorporated. Mastercard and the circles design are registered trademarks of Mastercard International Incorporated.\r\n\r\nTo see terms and conditions relating to OnePay's products, visit www.onepay.com/terms\r\n\r\nEligible deposits requirement met when your OnePay Cash account either (i) receives Direct Deposits totaling $500+ in the current or previous month or (i) had a balance of $5,000+ at the end of the previous month.\r\n\r\n‡﻿﻿﻿Cash back is earned as OnePay Points, redeemable into a OnePay Cash account or other available options. Only available to customers who unlock OnePay Cash+ with eligible deposits. Spend cap applies to your total spend across the cash back categories you selected during the month. See onepay.com/rewards-terms.\r\n\r\n**Must be 18 or older. When on, Savings Backup will be used before Fee-Free Overdraft. Overdraft balance is due right away. Eligible transactions are at the discretion of OnePay and may exclude certain transactions (e.g., bill pay, global transfers). See details at onepay.com/overdraft-details.\r\n\r\n+Based on a 12 month loan with $25 monthly payments and a 0% APR. You can choose how much you’d like to pay towards your monthly payment, with a minimum of $1. If you choose an amount less than the full monthly payment, the remainder will be paid from the loan proceeds held in your Credit Builder lockbox. Use of the Credit Builder Program does not guarantee that your credit score will improve. Credit score improvement is dependent on your specific circumstances and a variety of factors, including your financial behavior. Failure to make monthly minimum payments on time may negatively impact your credit score. See onepay.com/legal/licenses.\r\n\r\n†Cash back is earned as OnePay Points, redeemable as a deposit into a OnePay Cash account pursuant to the OnePay Rewards Terms. Individual reward details can be found in the OnePay app. \r\n\r\n\r\n∞Subject to credit approval. Cash back is earned as points on purchases made with your OnePay CashRewards Mastercard, which can be redeemed as a statement credit or as a deposit into a OnePay Cash account. \r\n\r\n\r\nʌʌOffer is valid for new accounts only and may only be applied once. Cash back is earned as points, which can be redeemed as a statement credit or as a deposit into a OnePay Cash Account. See onepay.com/rewards-terms. for details. Limited time offer. We reserve the right to change or discontinue this offer at any time.\r\n\r\nʌDirect deposit required. Funds availability may vary depending on when your employer sends paycheck data.\r\n\r\n++Currency exchange rates vary. \r\n\r\n© Copyright 2025 One Finance, Inc.",
        "url": "https://play.google.com/store/apps/details?id=com.onefinance.one",
        "score": 4.72677,
        "ratings": 0,
        "installs": "5,000,000+"
    },
    {
        "title": "Bank of America Mobile Banking",
        "appId": "com.infonow.bofa",
        "developer": "Bank of America",
        "icon": "https://play-lh.googleusercontent.com/GdICLxnKd-e-lmV46N_SjihWHzAUX1nj8e--dF2KrQjvomN4zxOR-iEWwsTG_Tqr_oc",
        "description": "Bank conveniently and securely with the Bank of America® Mobile Banking app for U.S.-based checking, savings, credit card, loan and investment accounts.\r\n\r\nManage Accounts\r\n•View account balances and review activity\r\n•Activate or replace credit/debit cards\r\n•Set alerts for important account info\r\n•Manage all accounts, including checking, savings, credit cards, loans and investment accounts. \r\n\r\nTransfer Money and Pay Bills \r\n•Securely send and receive money with Zelle® using a U.S. mobile number or email address¹\r\n•Transfer funds between your Bank of America and linked Merrill accounts\r\n•Pay bills\r\n\r\nCheck Deposit\r\n•Take photos of checks to deposit them to your checking or savings account\r\n•Get immediate confirmation that your check is processing²\r\n\r\nErica, Your Virtual Financial Assistant³\r\n•Ask Erica to find transactions, pay bills and more\r\n•Get valuable alerts, and helpful insights\r\n\r\nSecurity\r\n•Set up Touch ID® / Face ID®\r\n•If fraudulent activity is suspected on your card, we’ll notify you\r\n•View security center\r\n•With our Mobile Banking Security Guarantee, you’re not liable for fraudulent transactions when reported promptly⁴\r\n\r\nManage Investments with Merrill\r\n•Trade stocks, ETFs, mutual funds\r\n•View up-to-date Market data, news, and quotes\r\n•Send messages and documents securely to your advisor\r\n\r\nFICO® Credit Score:\r\n•Easily check your FICO® credit score\r\n•View the key factors that affect your score\r\n•Find out about keeping credit healthy\r\n\r\nFinancial Education and Savings & Budgeting Tools:\r\n•Set up and manage savings goals\r\n•Organize and track your spending by category\r\n•View all transactions\r\n•Compare spending against income\r\n• Easily create a budget based on previous spending or from scratch\r\n\r\nSee the Online Banking Service Agreement at bankofamerica.com/serviceagreement for more information. Mobile carrier message and data rates may apply.\r\n\r\n¹To send or receive money with Zelle®, both parties must have an eligible checking or savings account. Recipients have 14 days to register to receive money or the transfer will be canceled. Dollar and frequency limits apply. \r\n\r\n²Deposits are subject to verification and not available for immediate withdrawal. Other restrictions apply.\r\n\r\n³Erica does not provide investment advise. Erica only listens or speaks when you tap the microphone and retains interactions to optimize your experience. Erica speaks aloud and hears and responds to all voices. Erica is only available in English.\r\n\r\n⁴You’re not liable for fraudulent Mobile Banking transactions when you notify the bank within 60 days of the transaction first appearing on your statement and comply with security responsibilities.\r\n\r\nInvesting involves risk. There is always the potential of losing money when you invest in securities.\r\n\r\nMerrill Lynch, Pierce, Fenner & Smith Incorporated (also referred to as \"MLPF&S\" or \"Merrill\") makes available certain investment products sponsored, managed, distributed or provided by companies that are affiliates of Bank of America Corporation (\"BofA Corp\"). MLPF&S is a registered broker-dealer, registered investment adviser, Member SIPC and a wholly owned subsidiary of BofA Corp. \r\n\r\nInsurance and annuity products are offered through Merrill Lynch Life Agency Inc. (\"MLLA\"), a licensed insurance agency and wholly owned subsidiary of BofA Corp.\r\n\r\nBanking products are provided by Bank of America, N.A., and affiliated banks, Members FDIC and wholly-owned subsidiaries of Bank of America Corporation.\r\n\r\nInvestment products:\r\n• Are Not FDIC Insurance\r\n• Are Not Bank Guaranteed\r\n• May Lose Value \r\n\r\nZelle® and the Zelle® related marks are wholly owned by Early Warning Services, LLC and are used herein under license.\r\n\r\nFeatures may only be available for certain account types.\r\n\r\nAndroid is a trademark of Google Inc.\r\n\r\nGoogle emojis are used herein under license.\r\n\r\nBank of America and related trademarks are trademarks of Bank of America Corporation\r\nBank of America, N.A. Member FDIC\r\n©2025 Bank of America Corporation",
        "url": "https://play.google.com/store/apps/details?id=com.infonow.bofa",
        "score": 4.6162224,
        "ratings": 0,
        "installs": "50,000,000+"
    },
    {
        "title": "Current - Mobile Banking",
        "appId": "com.current.app",
        "developer": "Current",
        "icon": "https://play-lh.googleusercontent.com/jWZ5eL3rFrRg3YXn2KW8Crzxr9zpbtZ9d9s3AyLMfbC3rBZxsj0AiRAOhUlRZlKEgcQ",
        "description": "Power up your paycheck when you switch to Current. Get paid faster, save smarter, and build credit with ease—all in one app. Join over 6 million members already banking with Current today.\r\n\r\nWith Current you can:\r\n\r\n— Advance up to $750⁶: Access more of your paycheck if you qualify.\r\n\r\n— Overdraft fee-free⁵: Breeze from payday to payday without hidden fees.\r\n\r\n— Get paid up to 2 days early²: Receive your direct deposit as soon as your employer sends it.\r\n\r\n— Build credit while you bank.\r\n\r\n— Earn 1% cash back on dining and groceries⁴.\r\n\r\n— Enjoy 24/7 member support.\r\n\r\n— Access 40,000+ fee-free ATMs nationwide¹.\r\n\r\n— Add cash in-store at locations like CVS, Walgreens, and McDonald’s.\r\n\r\n— Earn up to a 4.00% bonus on savings³ and save automatically with Round-Ups.\r\n\r\n\r\nSee current.com/docs for full terms and conditions and current.com/legal_disclaimers for more info.\r\n\r\nCurrent is a financial technology company, not an FDIC-insured bank. FDIC insurance up to $250,000 only covers the failure of an FDIC-insured bank. Certain conditions must be satisfied for pass-through deposit insurance coverage to apply. Banking services provided by Choice Financial Group, Member FDIC, and/or Cross River Bank, Member FDIC.\r\n¹ Most AllPoint® ATMs are fee-free. To see if an ATM qualifies for fee-free ATM transactions, please check the Mobile App.\r\n² Faster access to funds is based on comparison of traditional banking policies and deposit of paper checks from employers and government agencies versus deposits made electronically. Delays by the employer, payer, or their banks may result in delayed access to funds beyond our control.\r\n³ Boost Bonuses are credited to your Savings Pods within 48 hours of enabling the Boost feature and on a daily basis thereafter, provided that the Savings Pod has accrued a Boost Bonus of at least $0.01. No minimum balance required. The Boost rate on Savings Pods is variable and may change at any time. The disclosed rate is effective as of August 1, 2023. Must have $0.01 in Savings Pods to earn a Boost rate of either 0.25% or 4.00% annually on the portion of balances up to $2000 per Savings Pod, up to $6000 total. The remaining balance earns 0.00%. To earn a Boost rate of 4.00%, you must receive at least one Eligible Payroll Deposit equalling a minimum of $200 over a 35-day period. T&C: current.com/boost_terms_of_service\r\n⁴ For eligible customers only. You may earn Points in connection with your Build Card purchases at retailers whose merchant code is classified as: Dining (e.g., restaurants) and Groceries (e.g., supermarkets) and by completing other actions that Current designates as subject to the Current Points Program. The amount of Points granted for different actions as well as the purchase requirements necessary to earn Points will vary, and is subject to Current’s sole discretion. After qualifying, please allow 3-5 business days for points to post to your Current account. Points will expire 365 days after they settle. T&C (including specific eligibility criteria): current.com/current_points_terms_and_conditions\r\n⁵ Actual overdraft amount may vary and is subject to change at any time, at Current’s sole discretion. In order to qualify and enroll in the Fee-Free Overdraft feature, you must receive a minimum of $200 or more in Eligible Direct Deposits into your Current Account over the preceding 35-day period and fulfill other requirements subject to Current’s discretion. Negative balances must be repaid within 60 days of the first Eligible Transaction that caused the negative balance.  T&C: current.com/overdraft_protection_terms_of_service\r\n⁶ For eligible customers only. Paycheck Advance is offered by Finco Advance LLC, a financial technology company, not a bank. T&C: current.com/docs/paycheck_advance_terms",
        "url": "https://play.google.com/store/apps/details?id=com.current.app",
        "score": 4.4971237,
        "ratings": 0,
        "installs": "5,000,000+"
    },
    {
        "title": "Venmo",
        "appId": "com.venmo",
        "developer": "Venmo",
        "icon": "https://play-lh.googleusercontent.com/YAKMX5YFcuE8_NogkbM7gkqrhBY6CUefbpULAVnNZLSitbo9S3Dw2FIYNqhW0d5G94Y",
        "description": "Venmo is the fast, safe, social way to pay and get paid. Join over 90+ million people who use the Venmo app today\r\n \r\nSEND AND RECEIVE MONEY\r\nPay and get paid for anything from your share of rent to a gift. Add a note to each payment to share and connect with friends\r\n\r\nSPLIT A REQUEST AMONG MULTIPLE VENMO FRIENDS\r\nYou can now send a payment request to multiple Venmo friends at once and customize the amount each person owes\r\n \r\nGET REWARDED WITH THE VENMO CREDIT CARD\r\nEarn up to 3% cash back on your eligible top spend category¹ —we’ll do the math. Split card purchases with Venmo friends, and shop everywhere Visa® credit cards are accepted—online, in-store, worldwide²\r\n\r\nBUY CRYPTO WITH AS LITTLE AS $1\r\nBuy, hold, and sell cryptocurrency right on the Venmo app. New to crypto? Learn more with in-app resources. Crypto is volatile, so it can rise and fall in value quickly. Be sure to take it at a pace you're comfortable with³\r\n\r\nSHOP WITH THE VENMO DEBIT CARD\r\nSpend your money in Venmo everywhere Mastercard® is accepted around the globe  — and earn cashback from some of your favorite spots. Terms apply: venmo.me/rewards⁴\r\n\r\nVENMO TEEN ACCOUNTS\r\nA debit card of their very own and a Venmo account to send money to trusted friends and family⁵. All with no minimum balance or monthly fee\r\n \r\nDO BUSINESS ON VENMO\r\nCreate a business profile for your side gig, small business, or anything in between—all under your same Venmo account\r\n\r\nMANAGE YOUR MONEY\r\nGet your Venmo money in the bank within minutes using Instant Transfer⁶. Want your paycheck up to two days earlier* than your normal payday? Try Direct Deposit\r\n \r\n¹Use of cash back is subject to the terms of the Venmo account. See Rewards Program Terms: https://www.synchronycredit.com/gecrbterms/html/RewardsTerms.htm\r\n²Application subject to credit approval. You must be at least 18 years old and reside in the US or its territories to apply. You must have a Venmo account in good standing, that has been open for at least 30 days prior to application\r\nThe Venmo Credit Card is issued by Synchrony Bank pursuant to a license from Visa USA Inc. VISA is a registered trademark of Visa International Service Association and used under license\r\n³Terms apply. Only available in the US and limited in certain states. Buying and selling cryptocurrency is subject to a number of risk and may result in significant losses. Venmo does not make any recommendation regarding buying or selling cryptocurrency. Consider seeking advice from your financial or tax adviser\r\n⁴The Venmo Mastercard® is issued by The Bancorp Bank, N.A., pursuant to license by Mastercard International Incorporated. Mastercard and the circles design are registered trademarks of Mastercard International Incorporated. The Bancorp Bank, N.A. is issuer of the Card only and not responsible for the associated accounts or other products, services, or offers from Venmo\r\n⁵ The Venmo Teen Debit Card is available for eligible users 13-17 years old with parent or legal guardian sign up. Terms apply\r\n⁶ Transfer speed depends on your bank and could take up to 30 minutes. Transfers are reviewed which may result in delays or funds being frozen or removed from your Venmo account. * The availability of Direct Deposit is subject to your employer sending paycheck information 1-2 days in advance of payday. Early access compared to standard banking practice of posting funds at settlement and subject to your employer providing pay information to the bank prior to payday. It may take up to two pay cycles for Direct Deposit to take effect. Transactions are reviewed, which may result in delays or funds being frozen or removed from your account\r\n\r\nEmoji artwork is provided by emojitwo.github.io/, originally released as emojione.com/ by Ranks.com with contributions from the Emojitwo community and is licensed under creativecommons.org/licenses/by/4.0/legalcode\r\n\r\nVenmo\r\n2211 N. First St., San Jose, CA 95131",
        "url": "https://play.google.com/store/apps/details?id=com.venmo",
        "score": 4.116753,
        "ratings": 0,
        "installs": "50,000,000+"
    },
    {
        "title": "Cash App",
        "appId": "com.squareup.cash",
        "developer": "Block, Inc.",
        "icon": "https://play-lh.googleusercontent.com/s7I0yvyhwfecAh8wm8HvaPekT9197kfPQQKPvQ1QTkt2M-mmPaeqrdVUqoOiG6mv9r4",
        "description": "Cash App makes it easy to:\r\n• Send, spend, save, and invest your money*\r\n• Borrow extra cash when you need it \r\n• Help teens get started with money \r\n\r\nSend money instantly for free. When you bank* through Cash App, you can get paid up to 2 days early.\r\n\r\nBuy bitcoin and sell bitcoin. Over 21 million people have bought bitcoin with Cash App.\r\n\r\nGet a Cash App Card, a customizable debit card that works with Apple Pay, Google Pay, and digital wallets. Save instantly with exclusive offers.\r\n\r\nDownload Cash App to take control of your cash.\r\n\r\nMILLIONS OF FAMILIES TRUST CASH APP\r\n• Anyone 13 to 17 can use Cash App when sponsored by a parent or guardian**\r\n• Get extra security features and parental controls\r\n• Design a debit card\r\n• Create healthy money habits\r\n\r\nP2P PAYMENTS\r\n• Send and receive money for free—all you need is a person’s phone number, email, $Cashtag, or QR code\r\n• Avoid scams with proactive security features\r\n\r\nCUSTOMIZABLE DEBIT CARD*\r\n• Cash App Card works where Visa® is accepted\r\n• No monthly or hidden fees\r\n• Exclusive styles\r\n• Real-time alerts\r\n• 24/7 fraud monitoring\r\n\r\nSIMPLIFIED BANKING*\r\n• No minimum balance requirements\r\n• Distribute part of your paycheck to savings, stocks, or bitcoin*\r\n• Free in-network ATM withdrawals and up to $200 in free overdraft coverage when you direct deposit $300+ each month***\r\n\r\nEASY WAYS TO SAVE\r\n• Earn up to 3.5% interest when you direct deposit $300+ each month****\r\n• Round up your spare change or put part of your paychecks into savings, stocks, or bitcoin*\r\n\r\nEXCLUSIVE DISCOUNTS & ACCESS\r\n• Save on everyday spending with offers\r\n• Get access to concert presales & exclusive events\r\n\r\nINVEST IN STOCKS & BUY BITCOIN*****\r\n• Buy stocks or bitcoin with as little as $1\r\n• Get paid in bitcoin & buy stocks with no commission fees\r\n\r\n—\r\n\r\n*Cash App is a financial services platform, not a bank. Banking services provided by Cash App’s bank partner(s). Prepaid debit cards issued by Sutton Bank, Member FDIC. Offers, Round ups, Savings and Overdraft protection are provided by Cash App, a Block Inc. brand. Eligibility requirements apply, see terms for details. Brokerage services by Cash App Investing LLC, member FINRA/SIPC, subsidiary of Block, Inc. Bitcoin services provided by Block, Inc. Bitcoin services are not licensable activity in all U.S. states and territories. Block, Inc. operates in New York as Block of Delaware and is licensed to engage in virtual currency business activity by the New York State Department of Financial Services. Investing and bitcoin are non-deposit, non-bank products that are not FDIC insured and involve risk, including monetary loss. P2P services & Savings are provided by Block, Inc. & not Cash App Investing LLC.\r\n\r\n**To view the eligibility requirements for sponsoring a teen, please visit the Sponsored Accounts section of the Cash App Terms of Service.\r\n\r\n***Cash App waives ATM fees for all in-network withdrawals when you direct deposit at least $300 monthly into Cash App.\r\n\r\n****Cash App will pass through a portion of the interest paid on your savings balance held in an account for the benefit of Cash App customers at Wells Fargo Bank, N.A., Member FDIC. To earn the highest interest rate on your Cash App savings balance, you need to be 18 or older, have a Cash App Card, and direct deposit at least $300 monthly into Cash App. Sponsored Accounts are not eligible to earn interest. Other exceptions may also apply. Savings yield rate is subject to change.\r\n\r\n*****Investing involves risk; you may lose money. Cash App Investing LLC does not trade bitcoin & Block, Inc. is not a member of FINRA or SIPC. This is not a recommendation for you to transact in securities. Fractional shares are not transferable. For additional conditions & limitations, see the Cash App Investing LLC Customer Agreement. Regulatory & external transfer fees may apply, see the House Rules. Cash App Investing LLC is not a bank.\r\n\r\nContact Cash App Support by phone at (800) 969-1940 or mail at:\r\nBlock, Inc.\r\n1955 Broadway, Suite 600\r\nOakland, CA 94612",
        "url": "https://play.google.com/store/apps/details?id=com.squareup.cash",
        "score": 4.678778,
        "ratings": 0,
        "installs": "100,000,000+"
    },
    {
        "title": "Wells Fargo Mobile®",
        "appId": "com.wf.wellsfargomobile",
        "developer": "Wells Fargo Mobile",
        "icon": "https://play-lh.googleusercontent.com/V4Yc04vLdkmQwvUQnFf_BQ90mMxthw4uXaOTfeA1hTWbFz4jnq2MmLntbO5bTBXFJjg",
        "description": "Account Management\r\n•Access your cash, credit, and investment accounts with Fingerprint Sign On¹ or Biometric Sign on¹\r\n•Review activity and balances\r\n•View your credit card transactions and manage your rewards\r\n•Easily activate or turn cards on or off², add cards to digital wallets³, view recurring payments, and manage account access with Card Settings\r\n\r\nDeposit Funds⁴\r\n•Deposit checks using your Android™ camera \r\n•Instantly view the processing deposit in your account\r\n\r\nMake Transfers and Payments\r\n•Transfer funds between your Wells Fargo accounts and to other financial institutions⁵\r\n•Send and receive money with friends and family using a U.S. mobile phone number or email address with Zelle®⁶\r\n•Pay your bills\r\n\r\nTrack Investments\r\n•Monitor balances, holdings, account activity, and open orders for your WellsTrade® accounts\r\n•Get real-time quotes, charts, and market data\r\n\r\nStay Secure\r\n•Visit the Security Center to report fraud and maintain safe accounts\r\n•Manage alerts⁷\r\n•Get notified of suspicious card activity with alerts\r\n•Access to your FICO® Credit Score\r\n\r\nContact Us\r\n•Email appstorefeedback@wellsfargo.com\r\n•Locate one of more than 12,700 ATMs or find one of our approximately 4,800 branches\r\n•Set up an appointment to meet with a Banker\r\n____________________________\r\nScreens are simulated.\r\n1.Only certain devices are eligible to enable Fingerprint Sign On or Biometric Sign On.\r\n2.Turning your card off is not a replacement for reporting your card lost or stolen. \r\n3.Not all smartphones are enabled to use a digital wallet. Your mobile carrier's message and data rates may apply.\r\n4.Some accounts are not eligible for mobile deposit. Deposit limits and other restrictions apply.\r\n5.Terms and conditions apply. See Wells Fargo’s Online Access Agreement for more information.\r\n6. Mobile numbers may need to be enrolled with Zelle® before they can be used. Available to U.S.-based bank account holders only. \r\n7.Sign-up may be required. \r\n8.Some features not offered on all devices or to all users.\r\n\r\nAndroid, Google Play, Chrome, Pixel and other marks are trademarks of Google LLC.\r\n\r\nFICO is a registered trademark of Fair Isaac Corporation in the United States and other countries.\r\n\r\nZelle® and the Zelle® related marks are wholly owned by Early Warning Services, LLC and are used herein under license.\r\n\r\nInvestment and Insurance Products are:\r\n•Not Insured by the FDIC or Any Federal Government Agency\r\n•Not a Deposit or Other Obligation of, or Guaranteed by, the Bank or Any Bank Affiliate\r\n•Subject to Investment Risks, Including Possible Loss of the Principal Amount Invested\r\n\r\nDEPOSIT PRODUCTS OFFERED BY WELLS FARGO BANK, N.A. MEMBER FDIC.\r\n\r\nInvestment products and services are offered through Wells Fargo Advisors. Wells Fargo Advisors is a trade name used by Wells Fargo Clearing Services, LLC (WFCS) and Wells Fargo Advisors Financial Network, LLC, Members SIPC, separate registered broker-dealers and non-bank affiliates of Wells Fargo & Company. WellsTrade(R) and Intuitive Investor(R) accounts are available through WFCS.\r\n\r\nUse of stock symbols is for illustrative purposes only and not a recommendation.\r\n\r\n9.$0 per trade is applicable to commissions for online and automated telephone trading of stocks and exchange-traded funds (ETFs). For stock and ETF trades placed with an agent over the telephone, a $25 agent-assisted trading fee is charged. Each trade order will be treated as a separate transaction subject to commission. An order that executes over multiple trading days may be subject to additional commission. One commission will be assessed for multiple trades, entered separately, that execute on the same day, on the same side of the market. Other fees and commissions apply to a WellsTrade account. Schedule subject to change at any time.\r\nRSNIP-02212027-8313203.1.1",
        "url": "https://play.google.com/store/apps/details?id=com.wf.wellsfargomobile",
        "score": 4.818856,
        "ratings": 0,
        "installs": "10,000,000+"
    },
    {
        "title": "SoFi: Bank, Invest & Loans",
        "appId": "com.sofi.mobile",
        "developer": "Social Finance, LLC",
        "icon": "https://play-lh.googleusercontent.com/2cUGJUpk3zdo8AsWUXYpDXjm8uRVCbkn7WPD-DE-LO-K0ZDvgbYcNXZ-fjgw9yfzNxK3",
        "description": "<b>Mobile banking</b> and <b>investing</b> made easy. <b>Send money</b> instantly, deposit checks digitally, pay bills online, track spending with <b>budgeting tools</b>, save cash in high-yield accounts, and <b>trade stocks</b> with no commission (other fees apply).\r\n\r\nJoin 12.6M members banking, investing, and saving with SoFi.\r\n\r\n<b>MOBILE BANKING & CHECKING ACCOUNT</b>\r\n• Checking account with no account fees, no minimum balance- mobile banking made easy.\r\n• Direct deposit gets you paid up to 2 days early⁵ with instant access to your funds.\r\n• Send money, pay bills online, transfer funds between accounts with no extra charges.\r\n\r\n<b>STOCK TRADING & INVESTING</b>\r\n• Trade stocks and ETFs with no commission through SoFi Securities (other fees apply).\r\n• Invest in fractional shares starting at just $5 to build your stock portfolio (restrictions apply).\r\n• Automated investing with digital portfolio management from SoFi Wealth.\r\n\r\n<b>HIGH-YIELD SAVINGS ACCOUNT</b>\r\n• Earn high APY¹ on savings balances.\r\n• Savings Vaults help organize emergency funds and savings goals in one place.\r\n• Instant transfers between checking and savings with no fees anytime.\r\n\r\n<b>PERSONAL LOANS & CREDIT SCORE</b>\r\n• Personal loan rates for debt consolidation, home improvements, and major purchases.\r\n• Track your credit score with regular updates and monitoring tools.\r\n• Pre-qualify for loans without affecting your credit score- compare rates instantly.\r\n\r\n<b>BUDGET TOOLS & MONEY MANAGEMENT</b>\r\n• Budget tracker with automatic spending categorization across all linked accounts.\r\n• Real-time spending alerts protect accounts and help maintain your budget.\r\n•.Bill payment reminders keep you on track and avoid late fees.\r\n\r\n<b>BANK SECURITY & CUSTOMER SUPPORT</b>\r\n• Bank-level encryption protects personal and financial information with fraud alerts.\r\n• Instant notifications for suspicious account activity keep your money safe.\r\n• Financial support team available 7 days/week via chat or (855) 456-SOFI (7634).\r\n\r\n¹SoFi members who enroll in SoFi Plus with Eligible Direct Deposit or by paying the SoFi Plus Subscription Fee every 30 days or SoFi members with $5,000 or more in Qualifying Deposits during the 31-Day Evaluation Period can earn 3.60% annual percentage yield (APY) on savings balances (including Vaults) and 0.50% APY on checking balances. There is no minimum Eligible Direct Deposit amount required to qualify for the stated interest rate. Members without either SoFi Plus or Qualifying Deposits, during the 30-Day Evaluation Period will earn 1.00% APY on savings balances (including Vaults) and 0.50% APY on checking balances. Interest rates are variable and subject to change at any time. These rates are current as of 11/12/25. There is no minimum balance requirement. If you have satisfied Eligible Direct Deposit requirements for our highest APY but do not see 3.60% APY on your APY Details page the day after your Eligible Direct Deposit arrives, please contact us at 855-456-7634. Additional information can be found at http://www.sofi.com/legal/banking-rate-sheet. See the SoFi Plus Terms and Conditions at https://www.sofi.com/terms-of-use/#plus.\r\n\r\n²We do not charge any account, service or maintenance fees for SoFi Checking and Savings. We do charge a transaction fee to process each outgoing wire transfer. SoFi does not charge a fee for incoming wire transfers, however the sending bank may charge a fee. Our fee policy is subject to change at any time. See the SoFi Checking & Savings Fee Sheet for details at sofi.com/legal/banking-fees/.\r\n\r\n⁵Early access to direct deposit funds is based on the timing in which we receive notice of impending payment from the Federal Reserve, which is typically up to two days before the scheduled payment date, but may vary. \r\n \r\n⁹9x based on FDIC monthly savings account rate as of December 16, 2024. See SoFi Checking and Savings rate sheet for annual percentage yield (APY) details at: https://www.sofi.com/legal/banking-rate-sheet.",
        "url": "https://play.google.com/store/apps/details?id=com.sofi.mobile",
        "score": 4.0163097,
        "ratings": 0,
        "installs": "5,000,000+"
    },
    {
        "title": "Starling - Mobile Banking",
        "appId": "com.starlingbank.android",
        "developer": "Starling Bank",
        "icon": "https://play-lh.googleusercontent.com/kydNWOPnfzQxOJziuvSeGtugGh2FfKhIoHJsmsN2-FMv5jLH1U2IYLwQT2VGqvngu5uWIonLcrHvcFTAbkZs",
        "description": "Our personal, business and joint accounts make managing your money as seamless, simple and satisfying as it should be in 2025. It's why we're the Which? Recommended Provider for a sixth year in a row.\r\n\r\nApply for a bank account online in minutes - for free - from your phone, and join the millions who have already discovered the better way to bank.\r\n\r\nWhat's in it for you?\r\n\r\nEarn interest on your money with the Easy Saver\r\n\r\n• Earn 3.00% AER / 2.95% gross (variable) interest with our easy-access savings account, managed in your app.\r\n• Add money as often as you like, in just a few taps. Withdraw whenever you need to, with no notice period and no penalties. There’s no minimum deposit, and you’ll earn interest on everything up to £1 million.\r\n\r\n18+, UK residents. Interest paid monthly. Starling personal current account required. Subject to eligibility. Gross is the contractual rate of interest payable before the deduction of income tax at the rate specified by law. AER stands for Annual Equivalent Rate and illustrates what the interest rate would be if interest was paid and compounded once each year.\r\n\r\nNo overseas fees\r\n\r\n• We won't charge you a penny for using your card abroad, or for withdrawing cash at an ATM.\r\n• We'll give you the Mastercard exchange rate, and won't add anything on top.\r\n• Get notifications in the local currency, and in GBP.\r\n\r\nBetter budgeting\r\n\r\n• Use Spaces to set money aside in a virtual change jar. Personalise with pictures, set a target, and track your progress.\r\n• Get instant payment notifications and track your balance in real-time\r\n• Learn where your money goes, and how to make savings, with Spending Insights\r\n• Use Bills Manager to set aside money for your bills. It means your main balance will only show you what's actually available for day-to-day spending.\r\n• Save on autopilot - automatically round up payments to the nearest pound and put away the spare change.\r\n\r\nPay and get paid seamlessly\r\n\r\n• Owed money? Send a simple link to get paid back.\r\n• Enjoy easy international transfers to 34 countries from your app – no hidden fees or exchange rate markups\r\n• Pay people instantly in-app – no fiddly card reader needed\r\n• Deposit cheques digitally from your phone and pay in cash at the Post Office.\r\n\r\nKeep your money safe\r\n\r\n• Your money is covered up to £85,000 by the Financial Services Compensation Scheme\r\n• With 24/7 in-app support from real humans in the UK, we're always here to help\r\n• Lock your card in-app and turn settings on and off, such as contactless, online, gambling and swipe payments\r\n\r\nBusiness banking\r\n\r\nNo monthly fees. Get mobile and web banking access, 24/7 support and simplified accounting. Deposit cash at the Post Office from as little as £3, and deposit cheques in-app by taking a photo. Automate your expenses, ring-fence money for bills, keep track of invoices with instant payment notifications and spot where your business is spending with smart analytics. Voted Best Business Banking Provider 2023.\r\n\r\nThe joint bank account\r\n\r\nManage collective household expenses or set aside money together; our joint account simplifies shared spending. Get instant payment notifications, track your spending with Insights, budget together and make important payments from one account.\r\n\r\nBanking for the whole family, all in one app\r\n\r\nKite is our free debit card and app for 6-15 year olds. It's built seamlessly into the adult's Starling account (personal or joint) for better visibility and control.\r\n\r\nStarling Bank Limited (trading as Starling) is registered in England and Wales (No. 09092149), 5th Floor London Fruit And Wool Exchange, 1 Duval Square, London, United Kingdom, E1 6PW. We are authorised by the Prudential Regulation Authority and regulated by the Financial Conduct Authority and the Prudential Regulation Authority under registration number 730166.",
        "url": "https://play.google.com/store/apps/details?id=com.starlingbank.android",
        "score": 4.49,
        "ratings": 0,
        "installs": "1,000,000+"
    },
    {
        "title": "Revolut: Spend, Save, Trade",
        "appId": "com.revolut.revolut",
        "developer": "Revolut Ltd",
        "icon": "https://play-lh.googleusercontent.com/bo7Qeq8XZVI4hyXTVyG7Oi3hMiqADqruYeyQWqzzJzNHCYNVLmpAne0XP4_JH2AJ1tE",
        "description": "Join the 60+ million customers worldwide who use our app to spend, send, and save smarter.\r\n\r\nMake your spend, well-spent\r\nPay any way, with physical cards, virtual cards, single-use virtual cards for extra protection, Google or Apple Pay\r\nSpend abroad with great exchange rates (fees additional to the rate provided may apply)\r\nAccess 55+ K in-network ATMs worldwide with no fees\r\nLink your external bank accounts to stay on top of all your spending\r\nDesign a physical card you vibe with (fees may apply).\r\n\r\nSet your kids up for financial success. Get them a Revolut ＜18 account, with their own card, so they can learn about money in a safe and fun way\r\n\r\nSend money near, far, wherever they are\r\nRequest or send 25+ currencies with a tap to anyone, anywhere\r\nChat, send, and receive money, in one place. Whatever your plans, transfers are almost instant between your Revolut friends with P2P payments\r\nSplit and settle bills in one place. You can even share a fun GIF to diffuse any tension\r\n\r\nSave the interest-ing way\r\nGrow your money with up to 4.25%* APY with Savings Vaults, Access your savings whenever you need to, with zero penalties or fees\r\nBuild your savings effortlessly — set up recurring transfers and round up spare change to stash cash\r\n\r\nExplore Stock Trading (capital at risk)\r\nStart trading stocks from $1 (other fees may apply)\r\nChoose from 2,000+ stocks to invest in some of the world's most popular companies\r\nEnjoy no-commission stock trading within your monthly allowance (other fees may apply)\r\n\r\nAll investments involve risk, including possible loss of principal. Investment accounts and disclosures may be displayed together. Self-directed brokerage products are provided by Revolut Securities Inc., member FINRA/SIPC. Brokerage Products •  Not FDIC Insured • No Bank Guarantee • May Lose Value. Automated investing is provided by Revolut Wealth Inc, an SEC-registered investment adviser.\r\n\r\nEnd the overspend\r\nGet instant spending notifications to keep track of every payment\r\nUse smart budgeting and analytics tools to stop wondering where your money went, and start telling it where to go\r\nWorried about missing upcoming payments or subscription charges? Don't be — we'll notify you beforehand\r\nUpgrade to one of our paid plans to get exclusive cards, more benefits, and even cooler perks. Pick the plan that's right for you: Premium or Metal (Paid Plan T&Cs and subscription fees apply).\r\n\r\nUnlock security features that you control\r\nFreeze and unfreeze your card in a tap\r\nUse single-use cards with new details generated each time you use it, for an extra layer of protection\r\nSet spending limits and get notifications to keep track of your money\r\n\r\nHow we protect your money\r\nOur sophisticated fraud prevention system flags high-risk transactions and pings you an alert, so you can spot scams, and nip 'em in the bud\r\nExtensive identity verification keeps sign-ups secure, and your account is protected with passcodes and biometrics\r\nWe're available 24/7 via our in-app customer support\r\n\r\nFunds in your Revolut Prepaid Card Account are held at or transferred to Lead Bank, Member FDIC, and are insured by the FDIC up to $250,000 applicable limits by the FDIC in the event Lead Bank fails if specific deposit insurance requirements are met. See FDIC-Prepaid Cards and Deposit Insurance Coverage.\r\n\r\nCalifornia Privacy Notice:  https://www.revolut.com/en-US/legal/privacy\r\n\r\n*The highest APY is available to users on a Premium or Metal plan. Annual Percentage Yield (APY) is a variable rate and subject to change. These APYs are accurate as of October, 20th, 2023. Monthly fees apply for Premium and Metal plans. Terms and Conditions Apply. No minimum amount required. Savings Vault services provided by Sutton Bank, Member FDIC\r\n\r\nRevolut Ltd (No. 08804411) is authorized by the Financial Conduct Authority under the Electronic Money Regulations 2011 (Firm Reference 900562). Registered address: 107 Greenwich Street, 20th Floor, New York, NY 10006",
        "url": "https://play.google.com/store/apps/details?id=com.revolut.revolut",
        "score": 4.464002,
        "ratings": 0,
        "installs": "50,000,000+"
    },
    {
        "title": "Vision Bank SA",
        "appId": "com.sdb.app.rl",
        "developer": "Vision Bank SA",
        "icon": "https://play-lh.googleusercontent.com/AB8K0uhCyjNJgAnV_WMEZuqodpZP3hNXoZm3JdyrHF58pt9VzPBxzLozakrsyhXYMNM",
        "description": "Welcome to Vision Bank, Saudi’s newest digital bank. \r\n\r\nBe among the first to experience the future of Shariah-compliant digital banking.\r\n\r\nDownload the Vision Bank app to secure your spot in the priority list. \r\n\r\nAs one of the first, you’ll automatically join the Visionary Club and unlock exclusive benefits, early features, and premium perks.\r\n\r\nWant to move up the list? Share your referral link with friends and climb faster towards early access.\r\n\r\nMade in Saudi. Powered by Innovation. Built for Visionaries.",
        "url": "https://play.google.com/store/apps/details?id=com.sdb.app.rl",
        "score": null,
        "ratings": 0,
        "installs": "50,000+"
    },
    {
        "title": "Regions Bank",
        "appId": "com.regions.mobbanking",
        "developer": "Regions Bank",
        "icon": "https://play-lh.googleusercontent.com/l8aZzwUDRG9684omNW6jtxi7uSyU-98nmHi-_3UaAW1FRBb_dhS_zYuBbj3UKfBogkw",
        "description": "**About this app**\r\nWe make everyday banking easy and simple.\r\n\r\nThe Regions Mobile app offers:\r\n**Account management**\r\n• Check your account balances anywhere\r\n• Search up to 18 months of transactions\r\n• Manage your cards and set alerts\r\n\r\n**Money movement**\r\n• Transfer funds between your accounts\r\n• Make mobile deposits\r\n• Send money with Zelle®\r\n\r\n**Security**\r\n• Log in securely with biometric ID\r\n• Protect your cards with LockIt®\r\n\r\n**Money management tools**\r\n• Access budget & planning tools\r\n• Pay bills with Regions Bill pay\r\n• Check your FICO® Score\r\n\r\n**Convenience**\r\n• Use the app in English or Spanish*\r\n• Schedule appointments with a Regions banker\r\n• Locate a Regions branch or ATM near you\r\n\r\nTo contact us, email MobileApps@Regions.com.\r\n\r\nCopyright 2025 Regions Bank. All Rights Reserved.\r\n\r\nMember FDIC. Equal Housing Lender.\r\n\r\nRegions, the Regions logo and the LifeGreen bike are registered trademarks of Regions Bank. The LifeGreen color is a trademark of Regions Bank.\r\n\r\nMobile Banking, Alerts, Text Banking and Mobile Deposit require a compatible device and enrollment in Online Banking. All are subject to separate terms and conditions. Mobile Deposit may be subject to fees. Your mobile carrier’s messaging and data fees may apply.\r\n\r\nZelle and the Zelle related marks are wholly owned by Early Warning Services, LLC and are used herein under license.\r\n\r\n* Certain services, products, and information (including official legal terms and disclosures for products and services) may only display in English. English content will govern in the event of any conflict in meaning.\r\n\r\nFICO® is a registered trademark of Fair Isaac Corporation in the United States and other countries.\r\n\r\n©2025 Fair Isaac Corporation. All rights reserved.",
        "url": "https://play.google.com/store/apps/details?id=com.regions.mobbanking",
        "score": 4.4838514,
        "ratings": 0,
        "installs": "1,000,000+"
    },
    {
        "title": "Moniepoint Personal Banking",
        "appId": "com.moniepoint.personal",
        "developer": "Moniepoint",
        "icon": "https://play-lh.googleusercontent.com/avSh0H6Uubym0Bv_AqlH7Zn875S_t7RN4RVwRLTLiFmO7_Vuv8jbKxLdFvTq7aa0r1A",
        "description": "<h2>Moniepoint Personal Banking App – Your Trusted Online Bank in Nigeria</h2>\r\nOpen a Moniepoint bank account and enjoy secure online banking from anywhere in Nigeria. With the Moniepoint Personal Banking app, you can send money instantly, receive payments, pay bills, buy airtime, and manage your savings account — all in one reliable mobile banking app.\r\n\r\nExperience modern digital banking that gives you control of your money. Moniepoint is the online bank made for your progress.\r\n\r\n<h2>Your All-in-One Online Banking Solution</h2>\r\nMoniepoint is more than a regular banking app — it’s a complete mobile payment app designed to make personal banking simple. With your Moniepoint bank account, you can manage your money, savings, and bills anytime, anywhere.\r\n\r\n<h3>Here’s what you can do with the Moniepoint Personal Banking App:</h3>\r\n<b>- Open a bank account instantly</b> – create your Moniepoint personal bank account in minutes and start banking online right away.\r\n\r\n<b>- Send and receive money fast </b>– enjoy reliable mobile payments and transfers with instant notifications.\r\n\r\n<b>- Earn up to 18% interest per annum </b>– grow your savings easily with flexible, fixed, or locked savings plans that match your goals.\r\n\r\n<b>- Pay bills conveniently</b> – handle electricity, TV, betting, education, government collections, and internet payments from your phone in seconds. \r\n\r\n<b>- Buy airtime and data</b> – recharge easily and get 2% cashback on every purchase. \r\n\r\n<b>- Request your Moniepoint debit card</b> – get your bank card delivered quickly and use it on all ATMs and POS terminals nationwide.\r\n\r\n<b>- Enjoy secure online banking</b> – advanced encryption keeps your bank account and data safe at all times.\r\n\r\n<b>- Resolve issues instantly</b> – settle disputes or reach support right from the app.\r\n\r\n<b>- Bank offline</b> – use *5573# to send money, check balance, or block your card without internet.\r\n\r\n<b>- Earn Moniepoint Rewards</b> – get cashback on interbank transfers (for new users), and discounts on airtime top-ups, and data purchases.\r\n\r\n<h3>Why Millions Trust Moniepoint in Nigeria</h3>\r\n- Licensed and regulated by the <b>Central Bank of Nigeria (CBN)</b>.\r\n- Insured by the <b>Nigeria Deposit Insurance Corporation (NDIC) </b>— your deposits are protected.\r\n- Trusted online bank serving millions of Nigerians.\r\n- Reliable personal banking app for everyday payments and savings.\r\n- 24/7 customer support for all your mobile banking needs.\r\n\r\nWith Moniepoint, your banking experience is fast, secure, and rewarding. Whether you want to send money, save money, or make payments, the Moniepoint app gives you everything you need in one digital banking platform.\r\n\r\n<h2>How to Open a Moniepoint Bank Account</h2>\r\n- Download the Moniepoint Personal Banking App on your phone.\r\n- Sign up to open your bank account in less than 5 minutes.\r\n- Request your debit card directly in the app — it will be delivered to your doorstep within 48 hours.\r\n\r\nNo paperwork. No branch visits. Just simple online banking made for your progress.\r\n\r\n<h3>Stay Connected</h3>\r\nHelpline: 01 888 9990\r\nWebsite: www.moniepoint.com\r\nWhatsApp: +234 908 843 0803\r\nInstagram, Facebook, X (formerly Twitter), YouTube: @moniepointmfb\r\nAddress: Plot 7A, Block 4, Admiralty Road, Lekki Phase 1, Lagos State, Nigeria.\r\n\r\n<h3>Download Moniepoint Personal Banking today.</h3>\r\nEnjoy secure online banking that lets you send money, save and earn up to 18% interest, pay bills, and manage your bank account easily — all from one trusted mobile payment app. Moniepoint is the online bank built for your financial freedom.",
        "url": "https://play.google.com/store/apps/details?id=com.moniepoint.personal",
        "score": 4.59375,
        "ratings": 0,
        "installs": "10,000,000+"
    },
    {
        "title": "Woodforest Mobile Banking",
        "appId": "com.woodforest",
        "developer": "Woodforest National Bank",
        "icon": "https://play-lh.googleusercontent.com/5wp95zlg_Nai7Djdv1I807ku23h7miF5ren0esJT8PqZ_MGIOB0KyHlIgqi9Maxtg02z",
        "description": "Enjoy the 24/7 convenience of banking with us on the go using the Woodforest Mobile Banking App.* Manage your accounts, make deposits, find branch locations, and more.\r\n\r\n•\tBIOMETRICS – Quickly access your account using fingerprint or facial recognition.\r\n•\tFORGOT PASSWORD – Set a new password from the convenience of your device when you’re having trouble remembering your current one.\r\n•\tACCOUNT BALANCES – View account balances and transaction details.\r\n•\tACCOUNT ALERTS – Stay up to date on your account balances by setting up Low Balance Alerts right in the app and start receiving alerts via email or push notification.\r\n•\tMOBILE DEPOSIT – Conveniently deposit checks with your device.\r\n•\tTRANSFER FUNDS – Transfer money between your Woodforest accounts.\r\n•\tBILL PAY – View scheduled and posted payments. Schedule recurring and one time bill payments.\r\n•\tTAX DOCUMENTS –  View and download eligible tax documents in the app.\r\n•\tSTATEMENTS – View your bank statements in the app and sign up for paperless E-Statements.\r\n•\tFIND LOCATIONS – Quickly and easily locate nearby branches and ATMs and find a location open when you need it by viewing location hours. See locations on a map and get step-by-step directions from your current location.  \r\n•\tMANAGE DEBIT CARDS – Turn your debit cards on/off, restrict transaction types, and set transaction type limits.\r\n•\tMANAGE EMAIL AND PHONE – Verify and manage your email addresses and phone numbers.\r\n•\tVANTAGESCORE® - Obtain your free VantageScore (credit score) right in the app. View your current score, progression over time, and learn what positive and negative factors are making an impact. \r\n•\tSEND MONEY – Send Money to your friends and family using Send Money in the app.\r\n•\tWESTERN UNION – Send or receive money all over the globe to your friends and family using Western Union right in the app.\r\n•\tAPPLY FOR A LOAN – Start the loan application process from your device.\r\n•\tCONTACT US – See where you can contact us about general inquiries, account information, or to report a lost or stolen card.\r\n•\tFREQUENTLY ASKED QUESTIONS – Quickly answer your mobile banking questions.\r\n•\tPRIVACY POLICY – Learn how we use state-of-the-art technology to protect you.\r\n \r\n \r\n*Woodforest Mobile Banking is free to download, but data charges from your cellular service provider may apply. Woodforest National Bank is not responsible for service outages that might affect your device or internet provider, technology failures, or device capacity limits. Additionally, account activity and history may not reflect recent expenditures.\r\n\r\nOther terms and conditions may apply to these products and services. For complete details regarding our products, services, and related fees please speak with a Woodforest Retail Banker.\r\n\r\n© 2025 Woodforest National Bank\r\nMember FDIC l Equal Housing Lender",
        "url": "https://play.google.com/store/apps/details?id=com.woodforest",
        "score": 4.810246,
        "ratings": 0,
        "installs": "1,000,000+"
    },
    {
        "title": "Mercado Pago: cuenta digital",
        "appId": "com.mercadopago.wallet",
        "developer": "Mercado Libre",
        "icon": "https://play-lh.googleusercontent.com/UrB8aayxpFSw0zzKNFSWGgqXbxfpQ_U_DLPCnjYVAlWN8GsnMkprpD80l3k6c0hEOKQRpnTxGtGeddgV3wFq7w",
        "description": "Con la cuenta digital de Mercado Pago puedes mantener tu dinero siempre seguro, además de tener una línea de crédito, realizar pagos y transferencias online de manera inmediata desde tu celular. <b>¡Disfruta de los beneficios de una cuenta digital en Mercado Pago!</b>\r\n\r\n¡Pide una tarjeta gratis y sin anualidad! Utiliza la tarjeta virtual para hacer compras online y en tiendas físicas. Si también quieres una tarjeta física pídela por la app, ¡y te la enviamos gratis a tu casa!\r\n\r\nSaca efectivo con tu tarjeta en supermercados y en cajeros de todo el país.\r\n\r\nTambién puedes obtener una línea de crédito para pagar servicios, recargar tu celular y comprar en Mercado Libre.\r\n\r\nConoce las ventajas de Mercado Pago:\r\n\r\n<b>Rendimientos diarios:</b> Genera rendimientos diarios en tu cuenta, es simple y lo activas a través de la app. Transfiere dinero con tarjeta de débito o dinero en cuenta y efectivo en tiendas.\r\n\r\n<b>Cuenta digital</b>\r\nCon la cuenta digital Mercado Pago, es mucho más sencillo pagar cuentas, recargar el celular y hacer transferencias a cualquier banco o a quien quieras, recibir pagos online y cuidar tus finanzas. Realiza todas tus transferencias desde un mismo lugar. \r\n\r\n<b>Cuida tus finanzas personales</b>\r\nLa cuenta digital funciona como una billetera virtual que te permite resolver pagos, evitando trámites y ahorrando tiempo.\r\n• Empieza a pagar cuentas y servicios desde la app.\r\n• Ten la facilidad de pagar servicios con código QR o link de pago y transferir dinero entre cuentas.\r\n• Puedes utilizar muchas alternativas para pagar tus compras: con saldo recargado en tu cuenta de Mercado Pago, tarjeta de crédito, débito o recargable, en efectivo con transferencia, depósito bancario o solicitar una línea de crédito.\r\n• Solicita una tarjeta física o una tarjeta virtual gratis, sin pagar anualidad ni emisión. \r\n• Realiza compras online o paga en hasta 12 mensualidades fijas con Mercado Crédito, sin usar tarjeta de crédito. \r\n• Haz recargas de celular y tarjetas MI. \r\n• Disfruta de los beneficios de Mercado Puntos: descuentos en compras, envíos gratis, facilidades en devoluciones y más.\r\n• Con tu cuenta digital también puedes obtener una línea de crédito para realizar pagos con QR, recargas, pago de servicios y compras en Mercado Libre, usando tu dinero como necesites.\r\n\r\n<b>Ve tu negocio crecer </b>\r\nDe ahora en más, ¡tú eliges cómo cobrar! Recibe pagos como quieras - pagos con código QR, link de pago por redes sociales o web, pagos con el lector de tarjetas Point - y empieza a vender online y presencialmente.\r\n \r\n• Adquiere el <b>lector de tarjeta Point</b> para vender, cobrar y recibir pagos.\r\n• Cobra con código QR o link de pago por WhatsApp, redes sociales, chats y más.\r\n• Cobra con tarjeta sin pagar gastos fijos.\r\n• Ofrece al cliente la posibilidad de transferir dinero y pagar a través de la app a tu cuenta digital.\r\n• Aprovecha para <b>aumentar tus ventas:</b>: con el lector de tarjeta Point, tú puedes recibir pagos seguros de forma online, cobrar y mejorar tus finanzas. \r\n• Si lo deseas, con Mercado Crédito puedes acceder a un préstamo para impulsar tu negocio. Lo pides 100% online, sin trámites ni papeles y el dinero se deposita en el acto en tu cuenta digital.\r\n\r\n¡Prepárate para vender más con Mercado Pago! Tú puedes vender online o presencialmente y cobrar de la manera que quieras. Empieza a recibir pagos con Point o vía transferencia, directamente en tu cuenta online.\r\n\r\nElige el lector de tarjeta Point para tu negocio ingresando en www.mercadopago.com.mx.\r\n\r\n* Producto disponible solo para la Área Metropolitana de CDMX.",
        "url": "https://play.google.com/store/apps/details?id=com.mercadopago.wallet",
        "score": 4.775862,
        "ratings": 0,
        "installs": "100,000,000+"
    },
    {
        "title": "Nu",
        "appId": "com.nu.production",
        "developer": "Nu",
        "icon": "https://play-lh.googleusercontent.com/NPkx0aiwABB31gBw_CuZO9Rwukhir-BwemxfNlAVjT6smwk6QgUbb3XrmsSSClfzk0dY",
        "description": "Nu is the world’s largest digital financial services platform outside of Asia, serving over 105 million customers across Brazil, Mexico, and Colombia. The company is the fourth-largest financial institution in Latin America by number of customers.\r\n\r\nGuided by our mission to fight complexity and empower people, we cater to customers’ complete financial journey, promoting financial access and advancement with responsible lending and transparency. \r\n\r\nThat's why our app was created to reflect everything we believe in: a transparent, simple, easy, and hassle-free experience, just as your financial life should be. No asterisks, tricks, or inexplicable fees.\r\n\r\nWe care about your financial peace of mind, that's why we offer human 24/7 support to help you via phone, email or your app’s chat.\r\n\r\n\r\n🇧🇷Brazil:\r\nNu is the most recommended financial institution in Brazil, with over 92 million customers who love being able to manage their entire financial lives directly from their mobile phones.\r\n\r\nOur solutions for Brazil include Credit Card, Loans, Investments, Insurance, PIX, Cashback, and way more.\r\n\r\n- Nu Pagamentos S.A. – Instituição de Pagamento. CNPJ: 18.236.120/0001-58. R. Capote Valente, 39 - Pinheiros, São Paulo - SP, 05409-000\r\n- Nu Financeira S.A. CNPJ: 30.680.829/0001-43\r\n\r\n🇲🇽Mexico:\r\nNu Mexico, with more than 8 million customers, offers a seamless financial experience with its Credit Card and Cuenta Nu\r\n\r\nEnjoy a credit card with no minimum purchase and a $0 annual fee, coupled with a savings account and debit card through Cuenta Nu.  Effortlessly manage your finances with Dimo®, enabling transfers using your CLABE or phone number.  Additionally, leverage Cajitas Nu to cultivate your savings and allocate funds for rent, vacations, or emergencies.\r\n\r\n- Nu is regulated by Banco de México and the CNBV, Products in Mexico are offered by Nu México Financiera S.A. de C.V. S.F.P.\r\n\r\n🇨🇴Colombia: \r\nNu has more than 1 million customers in Colombia whom have gain back the control of their time and money while saying goodbye to fine print, hidden charges and complexity with our Credit and Savings products.\r\n\r\nEnjoy managing your finances from your cellphone with real-time notifications of your movements, blocking and unblocking your cards as many times you want from your app, having 24/7 support through chat, phone or email and secure transactions thanks to our technology.\r\n\r\n___________________________________\r\n\r\n\r\nNu’s impact has been recognized in multiple awards, including Time 100 Companies, Fast Company’s Most Innovative Companies, and Forbes World’s Best Banks. Download the app and join the more than 105 million people who have said goodbye to bureaucracy, asterisks, paperwork, and fine print by joining the future of financial services.",
        "url": "https://play.google.com/store/apps/details?id=com.nu.production",
        "score": 4.581264,
        "ratings": 0,
        "installs": "100,000,000+"
    },
    {
        "title": "iMobile: Loan, Cards & Banking",
        "appId": "com.csam.icici.bank.imobile",
        "developer": "ICICI Bank Ltd.",
        "icon": "https://play-lh.googleusercontent.com/YH4tv0TgQ5vLLpmrTaGDDMe9DmPBgEjLu6cz597uDbnQIsyBnQMlnKIGhYtjEcbTaA",
        "description": "iMobile is ICICI Bank’s official Mobile Banking app that offers 400+ banking services.\r\n\r\nIt is accessible to both ICICI Bank customers & non-ICICI Bank customers for availing Loans, managing Savings Accounts, transferring funds, managing Cards, and investments. iMobile brings the power of Net Banking to your fingertips!\r\n\r\niMobile offers: \r\n\r\n📍Instant Loans such as Personal Loans, Home Loans, Car Loans and more \r\n📍Online Digital Savings Account\r\n📍Apply for Credit Cards\r\n📍Open Fixed Deposits(FDs), Recurring Deposits (RDs) or iWish Deposits\r\n📍Scan QR Codes for easy UPI Payments \r\n📍Hassle- free utility & electricity bill payments\r\n📍Instant online mobile recharge, DTH service, and FASTag recharge.\r\n📍Flight, train, and hotels bookings\r\n\r\nWith iMobile, you can enjoy the following benefits:\r\n\r\n✔ Pre-approved RuPay credit cards:\r\n\r\nRuPay Credit Card provide instant access to RuPay benefits, allowing seamless payments and UPI transactions.\r\n\r\n✔ Manage multiple cards: \r\n\r\nThrough iMobile, you can manage multiple Cards such as Debit cards, Credit Cards, and Forex Cards. You can also pay Credit Card bills for other banks, by scheduling reminders for due dates.\r\n\r\n✔ Investment made simple:\r\n\r\niMobile offers a hassle-free solution for investing and stock marketing. You can also invest in various Mutual Fund schemes, without opening a Demat Account.\r\n\r\n✔ iScore & Discover: \r\n\r\nUse the 'Discover' feature on iMobile to review your income and expenses. The 'Budget' feature helps you create and manage a budget, allowing you to practice financial discipline.\r\n\r\n✔ iFinance: All your bank accounts at one place:\r\n\r\nWith iFinance, experience a new and innovative way to view all your Bank Accounts in one place. Review your income and expenses, easily.\r\n\r\n✔ Unlock your rewards & personalized offers:\r\n\r\nEarn Reward Points and avail of exclusive offers by conducting transactions or paying utility bills through your Credit Card.\r\n\r\n✔ Customized notification: \r\n\r\nGet updates regarding your bills, Cards, Loans, Bank Accounts and more.\r\n\r\n✔ SmartLock: \r\n\r\nControl access to banking services such as Net Banking, UPI, and Credit and Debit Cards in one swipe.\r\n\r\n✔ Global UPI: \r\n\r\nNRI customers can conduct UPI payments with their international mobile number.\r\n\r\n✔ Chatbot assistance: \r\n\r\nEnjoy 24x7 chatbot assistance with iPal.\r\n\r\nPersonal Loan highlights:\r\n \r\n● Loan Amount: Min (₹25,000/-) to Max (as per the eligibility)*.\r\n● Repayment Tenure: 12 months to 72 months*. \r\n● Rate of Interest starting from 10.80% p.a.p.m*\r\n● Processing Fees starting from Rs. 3,999*\r\n\r\nFor Example: For an amount of ₹5 Lakh borrowed at an Interest Rate of 11.00% for 60 months, the payable amount would be : ₹10,817 p.m.\r\n\r\nThe total amount to be repaid after 5 years will be ₹ 6,52,273/- out of which the interest amount would be ₹1,52,273/-\r\n\r\n*Note: Terms and Conditions apply.                                                                                  \r\n\r\nOther offerings by ICICI’s iMobile : Forex Prepaid Cards, Companion Cards, SIPs, IPO Applications, Tap to Pay, Scan to Pay, Pay to Contact, PPF(Public Provident Fund), NPS(National Pension System), Gold Loan, Sovereign Gold Bonds, Term Life Insurance, Cancer Cover, Health/Travel/Motor Cover, 24 hours Top Up, PayLater.\r\n\r\nPre-approved Loans: Home Loan Balance Transfer, Education Loan, Loan against Property, Commercial Property Loan, Consumer EMI, Consumer EMI, Home Loan Overdraft, Insta FlexiCash Loan, Personal Loan on Credit Card.\r\n\r\nFor any feedback, queries or issues pertaining to iMobile App, please write to imobileapps@icicibank.com",
        "url": "https://play.google.com/store/apps/details?id=com.csam.icici.bank.imobile",
        "score": 4.519287,
        "ratings": 0,
        "installs": "50,000,000+"
    },
    {
        "title": "Capital One Mobile",
        "appId": "com.konylabs.capitalone",
        "developer": "Capital One Services, LLC",
        "icon": "https://play-lh.googleusercontent.com/qh5gnLn-UiQHOVnkBT666TRX48OIj7YX3Bwp4asEqOmf_1WLpKBxtJnWoYWYqdFFyg",
        "description": "What’s on the Capital One Mobile app? All of your accounts, and so much more.\r\n\r\nWhether you’re out in the world or feeling right at home, you can manage your money with ease:\r\n• View balances and export statements\r\n• Pay bills and take care of loans\r\n• Check in on your credit with CreditWise\r\n• Activate a credit or debit card when you need it\r\n• Redeem rewards on the go\r\n• Send and receive money with friends and family using Zelle®\r\n \r\nWith the Capital One Mobile app, you can ...\r\n• Stay informed when you enable alerts and purchase notifications\r\n• See everything that happens on your card with detailed transactions\r\n• Instantly lock your credit or debit card from anywhere\r\n• Get answers from Eno, your Capital One assistant\r\n\r\nDownload the app for better banking with Capital One.\r\n\r\n\r\nInternet access is needed to use the mobile app. Check with your Internet service provider for details of specific fees and charges. Service outages may occur. Capital One customers are responsible for regularly checking their account statements. Push, email, and SMS alerts and notifications, including purchase notifications, must be enabled to be received. CreditWise monitoring and alerts may not be available if the information you enter at enrollment does not match the information in your file at one or more consumer reporting agencies or you do not have a file at one or more consumer reporting agencies. Features may not be available to all customers. Actual experiences may differ from those depicted. Additional terms and limitations apply. \r\n\r\n© 2025 Capital One, N.A. Member FDIC. Zelle and the Zelle related marks are wholly owned by Early Warning Services, LLC and are used herein under license. To read about the Terms of your download, check out the End User License Agreement.\r\nhttps://www.capitalone.com/digital/mobile/android-eula/",
        "url": "https://play.google.com/store/apps/details?id=com.konylabs.capitalone",
        "score": 4.521535,
        "ratings": 0,
        "installs": "10,000,000+"
    },
    {
        "title": "Chime – Mobile Banking",
        "appId": "com.onedebit.chime",
        "developer": "Chime",
        "icon": "https://play-lh.googleusercontent.com/IihPs4IZsflvpscJVS14-ySG-BJH2B97Fv1nCEsr0e8YZXFxTiTSTesHz3UAF-bcaCvs",
        "description": "Unlock financial progress™ with Chime—credit tools, access to early pay, and no monthly fees.\r\n\r\nChime® is a financial technology company, not a bank. Banking services provided by The Bancorp Bank, N.A. or Stride Bank, N.A., Members FDIC.\r\n\r\nBETTER BANKING\r\nA high-powered checking account with fee-free in-network cash deposits§§, spending, overdraft coverage, free in-network ATMs‡, and more.\r\n\r\nEASY SAVINGS\r\nWith automatic savings tools and a high-yield savings account1, your small habits can make big strides with Chime.\r\n\r\nEARLY PAYDAY\r\nWhy wait for payday? When you direct deposit with Chime you get early access to your pay, up to $500^. No interest~, no credit check, and no mandatory fees. \r\n\r\nSMART CREDIT MANAGEMENT\r\nProtect, maintain, and grow your credit with everyday purchases and regular on-time payments‡‡.\r\n\r\nANYTIME SECURITY AND SUPPORT\r\nKeep your money and accounts safe with a modern set of features and 24/7 live human support.\r\n\r\nSPOTME®\r\nGet fee-free overdraft coverage up to $200* on Chime debit and credit card transactions and in-network ATM withdrawals.\r\n\r\n–––––\r\n\r\nThe Chime Visa® Debit Card and the secured Chime Visa® Credit Card are issued by The Bancorp Bank, N.A. or Stride Bank, N.A., pursuant to a license from Visa U.S.A. Inc. and may be used everywhere Visa debit or credit cards are accepted.\r\n\r\nMyPay® line of credit provided by The Bancorp Bank, N.A. or Stride Bank, N.A.\r\n\r\n¹Chime Checking Account required to apply.\r\n\r\n~Option to get funds instantly for $2 per advance or get funds for free within 24 hours. See Bancorp MyPay Agreement or Stride MyPay Agreement for details at www.chime.com/policies.\r\n\r\n*Eligibility requirements and limits apply. Overdraft only applies to debit and credit card transactions and cash withdrawals.  Limits range from $20-$200. \r\n\r\n‡Out-of-network ATM withdrawal and over the counter advance fees may apply except at MoneyPass ATMs in a 7-Eleven, or any Allpoint or Visa Plus Alliance ATM. \r\n\r\n§§Once the retailer accepts your cash, the funds will be transferred to your Chime account. Cash deposit fees may apply if using a retailer other than Walgreens and Duane Reade.\r\n\r\n^Eligibility requirements apply, including receipt of qualifying direct deposits as set forth in the MyPay Agreement. Not all users will qualify. Credit limits range from $20-$500. \r\n\r\n §The Annual Percentage Yield (\"APY\") for the Chime Savings Account is variable and may change at any time. The disclosed APY rate is effective as of [10/15/2025]. No minimum balance required. Must have $0.01 in savings to earn interest. The 3.50% Chime+ APY is available only while you maintain eligibility requirements for Chime+, otherwise the 1.00% APY for non-Chime+ members will apply. See Chime+ Terms and Conditions for details.\r\n\r\n**Out of network ATM withdrawal and OTC advance fees may apply. View the Bancorp agreement or Stride agreement for details; see back of card for issuer\r\n\r\n 2Eligibility requirements and limits apply. See Chime Deals® Terms and Conditions.\r\n\r\n4You must notify your financial institution immediately of any unauthorized use. For specific restrictions, limitations and other details, please consult your issuer.\r\n\r\n+Ranking according to the Federal Reserve Statistical Release based on domestic assets; number of ATMs self-reported by Chase, Bank of America and Wells Fargo - June 2025.\r\n\r\n‡‡Late payment may negatively impact your credit score. Results may vary.\r\n\r\nFICO® Score triggers a disclosure: Credit score calculated based on FICO® Score 8 model. Your lender or insurer may use a different FICO® Score than FICO® Score 8, or another type of credit score altogether. See Experian.com for details.\r\n\r\nAddress: 101 California Street, Suite 500, San Francisco, CA 94111, United States.\r\nNo customer support available at HQ. Customer support details available on the website.",
        "url": "https://play.google.com/store/apps/details?id=com.onedebit.chime",
        "score": 4.737753,
        "ratings": 0,
        "installs": "10,000,000+"
    },
    {
        "title": "Halifax Mobile Banking",
        "appId": "com.grppl.android.shell.halifax",
        "developer": "Lloyds Banking Group PLC",
        "icon": "https://play-lh.googleusercontent.com/gnwz03bfeirJCBbFXqUP87qEeJd8nc4HGmEVCNsxVVoRsT4BesuVrCZSVk256F_TTQ",
        "description": "Extra easy, quick and secure\r\n\r\nSee what your money’s doing, anytime, anywhere.\r\n\r\nDiscover why millions of current account customers choose our app.\r\n\r\nOur app is there for you, whether you’re on the move, at work or just relaxing at home. Tap, log in and check your balance, make payments or plan for your next big dream. Being there for you, it’s a people thing.\r\n\r\n<b>FEEL AT HOME</b>\r\n• Use your face or fingerprint to log in faster and more securely.\r\n•  Just open the app and explore your spaces to get quick access to everything you need, from statements to investments.\r\n\r\n <b>NO CARD? NO WORRIES</b>\r\n• Whether your card is lost, stolen or simply misplaced, relax knowing you can freeze it, order a new one, or look up your card details.\r\n\r\n<b>BE IN THE KNOW</b>\r\n• Stay ahead of your bills - your upcoming payments summary lets you know what’s being paid and when.\r\n• Spending insights helps you understand where your money goes every month.\r\n• Check your credit score and get personalised hints and tips to help you stay in control of your money and move closer to your big dreams, like getting a new home.\r\n• Never miss important updates again: personalise your notifications to stay on top of everything.\r\n\r\n<b>IN FOR A PENNY</b>\r\n• Make every penny count with Save the Change. It rounds up what you spend on your debit card to the nearest pound and moves the change into a savings account.\r\n• Get cashback from your favourite retailers with Everyday Offers.\r\n\r\n<b>CONTACTING YOU</b>\r\nWe won't contact you any more than normal if you use the app. But please stay alert to email, text messages or phone calls that appear to be from us. Criminals may try to trick you into giving them sensitive personal or account information. We'll never contact you to ask for these details. Any emails from us will always greet you personally using your title and surname and either the last 4 digits of your account number or the last part of your postcode '*** 1AB'. Any text messages we send you will come from Halifax .\r\n\r\n<b>IMPORTANT INFORMATION</b>\r\nMobile Banking is available to our Online Banking customers with a UK personal account. Services may be affected by phone signal and functionality. Terms and conditions apply.\r\n\r\nYou must not download, install, use or distribute our Mobile Banking apps in the following countries: North Korea; Syria; Sudan; Iran; Cuba and any other country subject to UK, US or EU technology export prohibitions.\r\nPlease note that features that require the use of your device’s phone capability, such as Call us, won’t work on tablets.\r\n\r\nWhen you use this app we collect anonymous location data to help combat fraud, fix bugs and improve future services.\r\n\r\nCashback Extras is available to Halifax bank account customers (excluding Basic Account holders) aged 18+ with a debit/credit card who bank online. Terms and conditions apply.\r\n\r\nFingerprint Sign-in requires a compatible mobile running Android 7.0 or higher and may not currently work on some tablets.\r\n\r\nSave the Change® is a registered trademark of Lloyds Bank plc and is used under licence by Bank of Scotland plc.\r\n\r\nHalifax is a division of Bank of Scotland plc. This app and Mobile Banking are operated by Bank of Scotland plc (registered in Scotland (No. SC327000) Registered office: The Mound, Edinburgh, EH1 1YZ). Authorised by the Prudential Regulation Authority and regulated by the Financial Conduct Authority and the Prudential Regulation Authority.",
        "url": "https://play.google.com/store/apps/details?id=com.grppl.android.shell.halifax",
        "score": 4.44,
        "ratings": 0,
        "installs": "10,000,000+"
    },
    {
        "title": "Dave: Credit, Cash & Money App",
        "appId": "com.dave",
        "developer": "Dave Operating LLC",
        "icon": "https://play-lh.googleusercontent.com/r6_h86OGSx8VSxY-5neD8NULRQ28s07XQGjveetmXMk3WnxPfE4MyYkYDMM5w3QR6BY",
        "description": "Take your finances to the next level with Dave.  \r\n\r\nDave Membership Information\r\n\r\n1-Dave is not a bank. Banking services provided by Evolve Bank and Trust, Member FDIC, or another partner bank, which issues the Dave Debit Card through a license from Mastercard®. ExtraCash amounts range from $25-$500, typically approved in 5 min, with an overdraft fee equal to the greater of $5 or 5%. Multiple overdrafts may be required. Not all members qualify for ExtraCash and few qualify for $500. ExtraCash is repayable on demand. Must open an ExtraCash overdraft deposit account and Dave Checking account. Up to $5 monthly membership fee for ExtraCash, Income Opportunity Services, and Financial Management Services. Optional 1.5% fee for external debit card transfers.\r\n\r\nUP TO $500 IN 5 MIN OR LESS(1)\r\nYou could pocket up to $500(1)  with ExtraCash™. There’s no credit check, interest, or late fees. \r\n\r\nEXTRACASH™ 101\r\nExtraCash™ offers the ability to get up to $500.(1) The amount of money you can take (your eligibility) refreshes daily. We determine your eligibility using several data points—like  your income history, spending patterns, and at least 3 recurring deposits. When you take ExtraCash™, you’ll agree to a settlement date to pay your outstanding balance. \r\n\r\nACCESS YOUR CASH INSTANTLY(2)\r\nGet up to $500 when you download Dave, link a bank account, open your Dave Checking  and ExtraCash™ accounts, & transfer it to your Dave Checking account. Your Dave Debit Mastercard® gives you instant, direct access to your money for hassle-free spending.\r\n\r\nEARN 4.00% APY(3)\r\nAdd money to your Dave Checking account or Goals account to grow your cash with this high annual percentage yield. Managing your money with Dave & online banking makes saving simple. \r\n\r\nGET PAID EARLY\r\nGet your paycheck up to 2 days early when you set up direct deposit.(4) A Dave Checking account streamlines your online banking experience, ensuring your money is available when you need it. A Dave Checking account makes handling money stress-free.\r\n\r\nSAY GOODBYE TO PESKY FEES\r\nDitch hidden fees with Dave. You can even skip ATM fees at 40K+ MoneyPass ATMs.(5) Your Dave debit card keeps your money accessible without added costs. A Dave Checking account ensures you can withdraw your money anytime without excessive fees. \r\n\r\nSAVE EFFORTLESSLY\r\nOwn your savings journey with a Goals account. Set up recurring deposits to build your savings steadily. Online banking through Dave simplifies saving your money for your future. The Checking account allows you to manage your money & expenses easily, keeping you connected to your savings at all times.\r\n\r\nMAKE MONEY ON THE SIDE\r\nExplore our Side Hustle board & easily apply for part-time roles, gig jobs, remote work, & more. Take Surveys that pay out instantly to your Dave Checking account. A debit card linked to your Checking account ensures you have quick access to your money, allowing you to track & transfer money effortlessly.\r\n\r\nOUR MEMBERSHIP FEE\r\nThere’s a small monthly membership fee that gives you full access to our features, including ExtraCash™, Goals, & Surveys.(1) With Dave, you can monitor your money 24/7 & make transactions securely.\r\n\r\nHAVE MORE QUESTIONS?\r\nSend us an email at support@dave.com.\r\n\r\nDisclosures related to the Dave app:\r\n\r\n2-Express fees apply to select instant transfers.\r\n\r\n3-Rates accurate as of 10/01/2024. The interest rates and annual percentage yields (APY) are variable and may change at any time at our discretion. No minimum deposit or minimum balance requirements. Fees could reduce earnings on the account.\r\n\r\n4-Early access to direct deposit funds depends on timing and availability of the payroll files sent from the payer. These funds can be available up to 2 business days in advance of the scheduled payment date.\r\n\r\n5-Out of network fees may apply.\r\n\r\nGeneral Terms\r\nSee the Dave Checking Deposit Agreement and Disclosures, Dave Goals Deposit Agreement and Disclosures, and the Dave ExtraCash™ Deposit Agreement and Disclosures for account terms and fees.",
        "url": "https://play.google.com/store/apps/details?id=com.dave",
        "score": 4.41537,
        "ratings": 0,
        "installs": "10,000,000+"
    },
    {
        "title": "NatWest Mobile Banking",
        "appId": "com.rbs.mobile.android.natwest",
        "developer": "National Westminster Bank PLC",
        "icon": "https://play-lh.googleusercontent.com/1yX6eldsO2xi_8REM0fwZ7JHpT9tGcSvv0_waTK2nXIX7nZMYUpe35asAt3HOnFRV1w",
        "description": "Join over 11 million customers and download our NatWest mobile banking app today to make your day-to-day banking easy, quick and secure.\r\nWhy the NatWest app?\r\n\r\nManage your money easily and securely:\r\n• Apply for current, savings, child, teen, premier and student accounts quickly. Eligibility criteria apply.\r\n• See all your bank accounts straight from your home screen.\r\n• Freeze and unfreeze your card at any time (Mastercard only).\r\n• Set up fingerprint, voice or facial recognition for better security and send high value payments in-app, amend payment limits and more. Fingerprint, voice or facial recognition are only available on selected devices.\r\n\r\nSend, receive and access money quickly:\r\n• Request money via a QR code or link.\r\n• Send money faster with a personalised list of favourite payees.\r\n• Split a bill up to £500 by sharing a payment request link with multiple people at once. (Eligible current accounts only. Payment requests can be sent to anyone with an eligible account with a participating UK bank and that uses online or mobile banking. Paying bank criteria and limits may apply.)\r\n• Get Cash in emergencies with a unique code without using your card. You can withdraw up to £130 every 24 hours at our branded ATMs. You must have a least £10 available in your account and an active debit card (locked or unlocked).\r\n\r\nStay on top of your spending and saving:\r\n• Keep track of payments all in one place.\r\n• Save your spare change with Round Ups if you have an eligible current account and instant access savings account. Round Ups can only be made on debit card and contactless payments in Sterling.\r\n• Budget easily by managing your monthly spending and set categories.\r\n• Turn on push notifications to get alerted when money reaches or leaves your account.\r\n\r\nGet support for every life event:\r\n• Spend abroad in Euros and US Dollars without fees or charges by applying for a Travel account. You must have enough money in your travel account. To apply for a Travel account, you need an eligible sole current account and to be over 18. Other terms and fees may apply.\r\n• Get updates on your credit score and insight on how to improve it. Your credit score data is provided by TransUnion and is only available to customers over 18, with a UK address.\r\n• Discover our additional products and services, including mortgages, home and life insurance and loans in one place.\r\n• Fast track your money goals with the help of our handy plans, tools and tips.\r\n\r\n\r\nImportant info\r\n\r\nPlease note, the app contains images when logging in that may cause a reaction in individuals who are photosensitive. You can switch these off for your device by visiting the settings menu and the accessibility menu where you will be able to find motion and visual control settings within the menu (note that this is not within our app, but on the settings of your device itself). \r\n\r\nOur app is available to customers aged 11+ with a UK or international mobile number in specific countries. Be aware that some features and products have age restrictions and are only available if you’re over 16 or 18.\r\n\r\nBy downloading this app, you’re accepting our Terms and Conditions, which can be viewed at natwest.com/mobileterms.\r\n\r\nPlease save or print a copy along with the Privacy Policy for your record.",
        "url": "https://play.google.com/store/apps/details?id=com.rbs.mobile.android.natwest",
        "score": 4.77,
        "ratings": 0,
        "installs": "10,000,000+"
    },
    {
        "title": "Inter – Banking & Investing",
        "appId": "br.com.intermedium",
        "developer": "Banco Inter SA",
        "icon": "https://play-lh.googleusercontent.com/GvBsmvf0foXr0_IF7nC7yxime14I1_Mq3AEZcTa2d-SYB-dqHNfB5YbFN9TC5fydIvs",
        "description": "Inter's banking super app helps you simplify your financial life with a full range of banking solutions—all in one app.\r\nSpend, invest in stocks, save with gift cards, and send money abroad directly from your phone.\r\n\r\nTake control of your finances in a modern way and access services designed for your lifestyle.\r\n\r\nWhy choose Inter?\r\n\r\n- Trusted by millions: More than 40 million people use Inter.\r\n- Your money is FDIC insured.\r\n- Gift cards with cashback: Explore offers and deals from top brands.\r\n- Physical & virtual debit card\r\n- Inter Passport Credit Card\r\n- Invest in stocks & ETFs from as little as $5.\r\n- Global money transfers : send money to over 60 countries, including Mexico, Colombia, Brazil, El Salvador, Guatemala, Honduras, Ecuador.\r\n\r\nAnd more:  \r\n\r\n- 24/7 multilingual support: English, Spanish, and Portuguese.\r\n- Inter LOOP rewards program: Earn points to exchange for gift cards and other perks.\r\n- Get eSIMS for your mobile data needs.\r\n\r\nOpen your digital account and access all services in one place. \r\n\r\nDISCLAIMER: \r\n\r\nINTER & CO PAYMENTS, INC., doing business as Inter (“Inter”), is a financial technology company, a registered money services business (MSB) and a licensed money transmitter, not a bank (NMLS ID #907330).  Massachusetts Foreign Transmittal Agency (License #FT114374-100). Rhode Island Currency Transmitter (License # 20203960CT). Click here to access our NMLS licenses. \r\n\r\nBanking services are provided by Community Federal Savings Bank (“CFSB”), Member FDIC and deposits are held by CFSB and Wells Fargo Bank, Members FDIC.  Inter is not a depository institution, deposits held at CFSB and Wells Fargo are not eligible for FDIC insurance.\r\n\r\nThe Inter US Checking account is provided by Continental Bank, Member FDIC. Inter US Checking accounts are FDIC-insured up to US$250,000. Inter US Checking account funds are eligible for FDIC insurance up to the allowable limit through Continental Bank, Member FDIC, and other program banks. Coverage is subject to aggregation of all of each account holder’s funds held on deposit at Continental Bank or at each of its program banks. Funds generated through Inter’s payment processing services are generally available in the Inter US Checking account balance immediately after a payment is processed. Fund availability times may vary due to technical issues. Inter is not a bank. Inter US Checking accounts do not provide monthly paper statements and do not issue physical paper checks. Inter US Checking accounts are not interest-bearing accounts. \r\n\r\nFDIC deposit insurance coverage only protects against the failure of an FDIC-insured deposit institution. If you have an Inter US Checking account, up to US$250,000 of your balance may be covered by FDIC insurance on a pass through basis through Continental Bank, Member FDIC, subject to aggregation of the account holder’s funds held at Continental Bank and if certain conditions have been met. \r\n\r\nMortgage services are provided by Inter US Finance, LLC (NMLS ID #1161874), an affiliate of Inter & Co Payments, Inc. \r\n\r\nSecurities brokerage services are provided by Inter&Co Securities LLC, Member FINRA/SIPC , an affiliate of Inter & Co Payments, Inc. and a wholly-owned subsidiary of Inter&Co US Holding.  View important information and disclosures here . \r\n\r\nIf you have any questions or concerns regarding any transaction, please write to us at 501 Brickell Key Drive, Suite 202, Miami, FL 33131, or by email at help@inter.co or by calling us at 1-888-305-7264. \r\n\r\nThe Inter US Mastercard® Credit Card is issued by Continental Bank, Member FDIC, pursuant to alicense from Mastercard International Incorporated and may be used wherever Mastercard debit is accepted. The Inter US Mastercard® Credit Card is issued by Continental Bank, Member FDIC, pursuant to a license from Mastercard International Incorporated, and may be used wherever Mastercard is accepted. For more information about the Inter US Mastercard credit and debit cards please see the applicable cardholder agreements.",
        "url": "https://play.google.com/store/apps/details?id=br.com.intermedium",
        "score": 4.512987,
        "ratings": 0,
        "installs": "50,000,000+"
    },
    {
        "title": "Monzo - Mobile Banking",
        "appId": "co.uk.getmondo",
        "developer": "Monzo",
        "icon": "https://play-lh.googleusercontent.com/aywdO4V_7CiuiggthXUWKy4zKlSt3CODeOEXVuGzQC94EGGi7jkZda5vGMzEFtnwVqFR",
        "description": "Meet the debit card that helps you save. With one app to manage all your finances, in real time.\r\nMonzo Pro is $10 a month. Open an account in a few minutes.\r\n\r\n<b> THE DEBIT CARD THAT HELPS YOU SAVE </b>\r\nGet cash back rewards on your debit card with Monzo Pro.\r\nGet cash back instantly: withdraw, spend or save it.*\r\n\r\n<b>NO STRESS SAVINGS</b>\r\n\r\nWith Monzo Pro, earn more interest with our best savings rate of 3.75% APY. Otherwise, you’ll receive 2.00% APY.†\r\nEvery month, earn interest on top of what you save.\r\nSet goals for your savings and we’ll help you work towards them.\r\nAutomatically contribute a portion of your paycheck towards your goals.\r\nTurn your spare change into savings with automatic roundups.\r\n\r\n<b>ALL YOUR MONEY, ONE APP</b>\r\n\r\nLink your other bank accounts, credit cards and savings accounts into Monzo.*\r\nGet money saving insights across all your bank accounts and credit cards.*\r\nGet paid early with direct deposits.*\r\nNo ATM fees from us, ever. And no ATM fees when you stick to the 38000+ MoneyPass ATMs. \r\n\r\n<b>SERIOUSLY SECURE</b>\r\n\r\nYour money is eligible for up to $250,000 in FDIC pass through insurance.**\r\nAnti-fraud systems that help keep your money safe, without adding friction for you.\r\nProtect your money with Touch ID, Face ID, and PIN.\r\n*Monzo Pro subscription may be required to access certain features. Fees and terms apply, see monzo.com/us for more details.\r\n\r\nMonzo’s Savings Jar Annual Percentage Yield (APY) is as of May 19, 2025. The APY may change at any time.\r\n\r\nRegistered address: Monzo Inc, 447 Sutter St., Ste 405 PMB1025, San Francisco, CA 94108\r\n\r\nMonzo is a financial technology company; not a bank. All banking services and deposit accounts are provided by Lead Bank or Sutton Bank; Members FDIC. The Monzo Personal and Joint Debit Card is issued by Lead Bank or Sutton Bank, Members FDIC, pursuant to licensing by Mastercard International Inc. See Terms and Cardholder Agreement for more details.\r\n\r\n†As of June 18, 2025, you'll earn 3.75% APY (Annual Percentage Yield) with a Monzo Pro subscription and 2.00% APY for Monzo Base users. No minimum deposit needed. These rates are variable and may change. The interest comes from us, not Lead Bank or Sutton Bank. Your total Savings Jar balance is capped at $100,000. Monzo isn't a bank. Banking services and debit card are issued by our partners, Lead Bank or Sutton Bank, Members FDIC.\r\n\r\n**Funds held in the Monzo deposit accounts are held with Lead Bank or Sutton Bank; Members FDIC, and funds aggregated across all deposits held at the member bank are eligible for up to $250,000 in pass-through insurance in the event Lead Bank or Sutton Bank fails, if specific deposit requirements are met, and your card is registered. You can find your sponsor bank in your cardholder agreement in the app. FDIC insurance does not protect funds in the event of Monzo’s failure or from the risk of theft or fraud. See FDIC Prepaid Cards and Deposit Insurance Coverage. \r\nCertain conditions must be satisfied for pass-through FDIC deposit insurance coverage to apply, which you can learn more about on fdic.gov.\r\n\r\nMonzo Pro is an optional, monthly paid subscription membership program. Subscribers will be charged every month. Once enrolled, subscribers have access to Monzo’s highest APY, cashback rewards, exclusive upgraded benefits and access outside of Monzo’s basic offerings. Please see Terms on monzo.com/us for more details.",
        "url": "https://play.google.com/store/apps/details?id=co.uk.getmondo",
        "score": 4.1451187,
        "ratings": 0,
        "installs": "10,000,000+"
    },
    {
        "title": "Banco Itaú: Conta, Cartão e +",
        "appId": "com.itau",
        "developer": "Itaú Unibanco S. A.",
        "icon": "https://play-lh.googleusercontent.com/gRcutACE4XkEHmxcbUdOehxpTbp_LjmwJ6qIEbqfD34oh9feTNhTnlDgf97HEZ9eGKY",
        "description": "Começou o Esquenta Itaú Week, com ofertas exclusivas de Black Friday. Aproveite os produtos e benefícios do Itaú Shop com até 60% de desconto e até 15% de cashback.\r\n\r\nTudo o que você pode fazer pelo app:\r\n\r\n◉ Itaú Shop\r\nCom o Itaú Shop você compra produtos com descontos de até 60%! Parcelamento em até 12X SEM JUROS ou pagamento à vista com CASHBACK.\r\n\r\n◉ Seguros\r\nContrate e personalize seguro de vida, seguro viagem, seguro residencial, seguro auto e mais.\r\n\r\n◉ Cartão Virtual\r\nCom cartão virtual você fica mais seguro para pagar assinaturas ou fazer compras online.\r\n\r\n◉ Pagamento por Aproximação com carteira digital\r\nCadastre seu cartão na Google Pay ou Samsung Pay e faça pagamentos por aproximação.\r\n\r\n◉ Tag Itaú\r\nFacilite seus deslocamentos com a Tag Itaú, que oferece aceitação nacional em pedágios e estacionamentos, garantindo comodidade e praticidade.\r\n\r\n◉ Aumento de Limite do Cartão de Crédito\r\nAumente o limite do seu cartão de crédito, usando o limite pré-aprovado.\r\n\r\n◉ Cashback\r\nComprando em lojas parceiras você ganha cashback para usar no Itaú Shop, crédito em faturas e mais. Para resgatar, acesse “Produtos” e clique em “pontos e cashback”.\r\n\r\n◉ Cartão de Débito e Cartão de Crédito\r\nSolicite e desbloqueie um novo cartão de crédito e débito, confira a fatura dos seus cartões e gere o cartão virtual para fazer compras online.\r\n\r\n◉ Investimentos\r\nDiversas opções de investimento para seu dinheiro continuar rendendo, como Tesouro Direto, Previdência Privada, Poupança e mais!\r\n\r\n◉ Empréstimo Pessoal* e Soluções em crédito\r\nSolicite empréstimo pessoal ou crédito imobiliário pelo app. Escolha o valor do empréstimo pessoal para ter liberação imediata na sua conta.\r\n\r\nTambém temos outros tipos de créditos para te apoiar.\r\n\r\n◉ Pagamento de Boletos com Cartão de Crédito\r\nPague boletos com cartão de crédito, parcele em até 12 vezes e aproveite a novidade: escolher em qual fatura começar a pagar — atual, próxima ou até duas à frente.\r\n\r\n◉ Transferências Bancárias\r\nComo em um banco digital, faça transferências para conta poupança ou conta corrente de qualquer banco online. Abrir conta no Itaú permite que você faça suas transferências de forma simples e rápida direto pelo app.\r\n\r\n◉ Pagamentos\r\nPague boletos escolhendo se o dinheiro sairá da conta corrente, conta poupança ou, se preferir, deixe suas contas em débito automático.\r\n\r\n◉ Minhas Finanças e Extrato Bancário\r\nConsulte o saldo da conta corrente e conta poupança, o extrato da conta bancária e a fatura dos cartões, além de gerenciar pagamentos online e transferências bancárias.\r\n\r\n◉ Reconhecimento Facial\r\nInstale o iToken por meio do reconhecimento facial e faça transferências, pagamentos e Pix.\r\n\r\n◉ Proteção contra golpes em ligações\r\nCom a sua permissão, vamos identificar e bloquear telefonemas de golpistas que tentam se passar pelo banco.\r\n\r\nPedir cartão de crédito e débito, consultar saldo da conta corrente e conta poupança, solicitar empréstimo pessoal, investir, renegociar financiamentos e mais.\r\n\r\nSe você ainda não é cliente, pode abrir conta direto pelo app: rápido, prático e sem burocracia.\r\n\r\nAcompanhe a fatura do cartão de crédito, pague por aproximação com o celular, use o cartão virtual na internet. E mais: compre no Itaú Shop com descontos + cashback ou parcelamento exclusivo!\r\n\r\nAlém de abrir conta, você pode pedir cartão de crédito SEM ANUIDADE, renegociar dívidas com parcelamento exclusivo, ganhar cashback em compras no Itaú Shop e contar sempre com a SEGURANÇA Itaú.\r\n\r\n*Para empréstimo pessoal, o dinheiro cai na hora após contratação nos casos de crédito já pré-aprovado pelo banco Itaú.\r\n\r\nITAÚ UNIBANCO S.A. - CNPJ: 60.701.190/0001-04\r\nITAU UNIBANCO HOLDING S/A - CNPJ: 60.872.504/0001-23\r\nBANCO ITAÚ CONSIGNADO S.A. - CNPJ: 33.885.724/0001-19\r\nPC ALFREDO EGYDIO DE SOUZA ARANHA, 100 - TORRE OLAVO SETUBAL - CEP: 04344-902 - São Paulo- SP - Brasil\r\nIUPP S.A. - CNPJ: 42.786.803/0001-63\r\nAv Eng Armando de Arruda Pereira, 774 - Torre Conceição 6° Andar - CEP: 04308-000 - Jabaquara - São Paulo - SP",
        "url": "https://play.google.com/store/apps/details?id=com.itau",
        "score": 4.6636243,
        "ratings": 0,
        "installs": "100,000,000+"
    },
    {
        "title": "PicPay: Conta, Cartão e Pix",
        "appId": "com.picpay",
        "developer": "PicPay",
        "icon": "https://play-lh.googleusercontent.com/pTvc9kCumx_24eJDwGUpvcBwljcIBkrsL3qHwhBW2NalMQ-XxTtHRV9YAJanBxkV0Rw",
        "description": "Promoção Chave do Milhão 💵\r\nPara participar basta cadastrar sua chave Pix. Você concorre a R$1 milhão no sorteio final e a prêmios semanais em dinheiro. Quanto mais PicPay você usar, mais chances você tem para concorrer.\r\n\r\n<b>É CLT? O Picpay deixa sua vida mais tranquila! Chegou o Crédito do Trabalhador, com ele você pode acessar o empréstimo consignado privado diretamente pelo PicPay, com taxas reduzidas e desconto em folha de pagamento.</b> Aproveite para obter crédito rápido, sem comprometer seu orçamento. Simule agora pelo app e aproveite as melhores condições para você!\r\n\r\n💚 Conta Digital: Rápida, Gratuita e Completa!\r\nConta digital 100% gratuita e fácil de usar. Gerencie todos os seus bancos em um único app, movimente, organize e faça Pix entre contas diferentes. Parcele suas compras em até 36x com qualquer cartão e realize transferências de qualquer banco de forma segura. Seu dinheiro ainda rende automaticamente a 102% do CDI, mais que a poupança.\r\n\r\n💳 Cartão de Crédito sem anuidade: Benefícios que você vai amar\r\nPara cada estilo de vida, um cartão personalizado:\r\n🥇 PicPay Card Gold: Cartão sem anuidade, parcelamento em até 36x, benefícios Mastercard Surpreenda e cashback no PicPay Shop.\r\n🥈 PicPay Card Platinum: Cashback de 0,5% em todas as compras no crédito, assistência global de emergência e seguro de automóveis.\r\n🖤 PicPay Card Black: Cashback de 1,2%, acesso a sala VIP, seguro viagem, concierge e benefícios exclusivos Priceless Cities.\r\n\r\nGanhe um cartão de crédito sem anuidade, com limite de até R$10 mil! Receba cashback em todas as compras, online e nas lojas parceiras\r\n\r\n⚡️ Pix Instantâneo: Transferências sem Taxa e em Tempo Real\r\nO Pix no PicPay permite pagamentos instantâneos a qualquer hora, com a opção de parcelar em até 36x. A pessoa recebe na hora e você paga só no vencimento da fatura. Você ainda aproveita vantagens como rendimento superior à poupança, cashback, promoções de lojas parceiras no PicPay Shop e a facilidade de recarregar serviços e dividir pagamentos.\r\n\r\n💰 Empréstimo PicPay: Crédito Rápido e Sem Complicação\r\nCrédito com aprovação rápida e sem burocracia, ideal para imprevistos, quitar dívidas com juros altos ou realizar projetos pessoais.\r\n\r\nEmpréstimo Pessoal: Simule diretamente no app, encontre ofertas pré-aprovadas e gerencie tudo sem sair de casa.\r\nAntecipação do FGTS: Receba seu dinheiro na conta em até 2 minutos! Sem mensalidade e com aprovação facilitada, mesmo para negativados.\r\n\r\n💡 Mais que uma conta digital: Soluções Financeiras Completas!\r\nAlém de transferências, Pix e empréstimos, o PicPay ainda oferece:\r\nConta Que Rende: Seu dinheiro cresce automaticamente, com rendimentos superiores à poupança (102% do CDI).\r\nInvestimentos: Diversifique sua carteira com opções seguras e acessíveis direto no app.\r\nParcelamento de Boletos: Pague suas contas em até 36x no cartão de crédito.\r\nCashback: Ganhe dinheiro de volta em diversas compras, direto na sua conta.\r\nConta Para Menores: Seus filhos também podem aproveitar os benefícios do PicPay com segurança e autonomia, iniciando a educação financeira desde cedo! 🎓\r\n🔒 Conta Digital com Modo Seguro\r\nSeu dinheiro e transações protegidos com um nível extra de segurança.\r\n\r\nO PicPay transforma sua forma de lidar com o dinheiro.\r\nPrecisa de ajuda? Acesse o nosso site https://picpay.com/\r\n\r\nTítulo Capitalização modalidade incentivo. ICATU CAPITALIZAÇÃO S/A. Processo SUSEP nº 15414.652674/2025-66. Período: 06/10/2025 a  21/11/2025.  Para mais informações sobre sorteio, consulte o regulamento em www.picpay.com/chavedomilhao. SAC PicPay: 0800 025 8000. Ouvidoria PicPay: 0800 025 2000. SAC ICATU: 0800 286 0109. Ouvidoria Icatu – 0800 286 0047.\r\n\r\nPicPay Instituição de Pagamento S.A., inscrita no CNPJ/ME sob o nº 22.896.431/0001-10, sediada na Avenida Manuel Bandeira, 291, Condomínio Atlas Office Park, Bloco A, 1° andar - escritórios 22 e 23, 2° andar e 3° andar, e Bloco B, 3° andar - escritórios 43 e 44, Vila Leopoldina, Município de São Paulo, Estado de São Paulo, CEP 05317-020",
        "url": "https://play.google.com/store/apps/details?id=com.picpay",
        "score": 4.3489795,
        "ratings": 0,
        "installs": "100,000,000+"
    },
    {
        "title": "BRImo",
        "appId": "id.co.bri.brimo",
        "developer": "PT Bank Rakyat Indonesia (Persero) Tbk.",
        "icon": "https://play-lh.googleusercontent.com/h_PjuN71zmHSHdynKxkl9R_j2ambqn978mfSEwmzPn_XzQWrBDr1mBM_QIDj__Uxu4w",
        "description": "BRImo merupakan mobile banking favorit masyarakat Indonesia dengan total 35,8 juta pengguna hingga saat ini. Dirancang untuk memfasilitasi berbagai transaksi keuangan nasabah kapan saja dan di mana saja, BRImo hadir dengan berbagai fitur unggulan yang memenuhi kebutuhan finansial dan gaya hidup dalam satu aplikasi. \r\n\r\nNikmati pengalaman finansial yang serba mudah dan serba bisa hanya dengan BRImo. Jangan sampai ketinggalan untuk merasakan kemudahan layanan BRImo yang banyak dipilih oleh jutaan pengguna!\r\n\r\n• Registrasi dari Dalam dan Luar Negeri\r\nBRImo memungkinkan pendaftaran akun BRI dan buka rekening secara full digital tanpa perlu kartu debit, baik dari dalam maupun luar negeri. Nasabah dapat mendaftar menggunakan nomor HP dari 11 negara, termasuk Jepang, Korea Selatan, Hong Kong, USA, Saudi Arabia, UAE, Kuwait, Malaysia, Taiwan, Singapura, dan Timor Leste. Proses pendaftaran menjadi lebih fleksibel dan mudah.\r\n\r\n• Transaksi Antar Negara\r\nBRImo memudahkan nasabah yang memiliki kebutuhan transaksi internasional melalui fitur transfer ke lebih dari 160 negara. Selain itu, BRImo mendukung pembayaran menggunakan QR di luar negeri (Singapura), memberikan kemudahan bertransaksi saat bepergian.\r\n\r\n• Lifestyle dan Entertainment\r\nBRImo menyediakan berbagai layanan gaya hidup serta hiburan seperti pembelian voucher game, streaming, tiket BRI Liga 1, hingga pemesanan dan pembayaran tiket transportasi termasuk pesawat, semuanya dalam satu aplikasi.\r\n\r\n• Investasi\r\nBRImo menyediakan beragam pilihan produk investasi bagi nasabah, mulai dari dana pensiun hingga emas. Bekerja sama dengan Pegadaian, BRImo menawarkan layanan jual, beli, dan cicil emas. Nasabah dapat mengelola investasinya dengan mudah melalui dashboard KSEI dan akses langsung ke BRIGHTS untuk pembelian saham.\r\n\r\n• Transaksi Sehari-Hari\r\nBRImo memudahkan berbagai transaksi harian, mulai dari pembayaran tagihan dan cicilan, top up e-wallet dan pulsa/paket data, hingga pembayaran QRIS dengan sumber dana kartu kredit. BRImo juga memungkinkan setor tunai tanpa kartu di ATM BRI, memberikan kemudahan ekstra dalam mengelola keuangan. Dapatkan BRIpoin setiap kali bertransaksi dan tukarkan poin tersebut dengan berbagai e-voucher menarik.\r\n\r\n• Layanan Pelanggan yang Mudah Diakses\r\nBRImo menyediakan layanan Contact BRI bebas pulsa, serta fitur chat dalam aplikasi untuk pengaduan transaksi, memastikan nasabah mendapatkan bantuan dengan cepat dan efisien.\r\n\r\n• Cashback Realtime\r\nBRImo menjadi satu-satunya aplikasi mobile banking yang menawarkan cashback secara realtime untuk berbagai transaksi finansial, memberikan nilai tambah bagi setiap transaksi yang dilakukan. Jangan lewatkan kesempatan untuk menikmati berbagai manfaat eksklusif hanya di BRImo!\r\n\r\nButuh Bantuan?\r\nHubungi Layanan Pelanggan BRI:\r\n* Telepon: 1500017\r\n* Email: callbri@bri.co.id\r\n\r\nIngin Tahu Lebih Banyak?\r\nTemukan informasi lengkap tentang BRI dan layanan lainnya:\r\n* Website: bri.co.id\r\n* Facebook: BRIofficialpage\r\n* Instagram: @bankbri_id\r\n* X: @kontakBRI\r\n* Youtube: @BANK_BRI",
        "url": "https://play.google.com/store/apps/details?id=id.co.bri.brimo",
        "score": 4.4338236,
        "ratings": 0,
        "installs": "50,000,000+"
    },
    {
        "title": "Citi Mobile®",
        "appId": "com.citi.citimobile",
        "developer": "Citibank N.A.",
        "icon": "https://play-lh.googleusercontent.com/UQXR3wgk9MFKyRW4II0RPWAFAT0LHOO0d1QDUI4_oy3JN9LEcMH1Sx8b-toXwh486bg",
        "description": "Simpler\r\nAll Mobile Account*: Open a checking or savings account right from the app without setting foot in a bank branch\r\nFast Navigation: Quickly get to your favorite features with an intuitive navigation menu and smart shortcuts \r\nCard Replacement: Request a new card if your original is lost, stolen or damaged\r\nCiti Mobile® Snapshot: Quickly review key account info – without having to sign in every time\r\nZelle®: A fast, fee-free way within the Citi Mobile App to pay and easily split payments with people you trust.**  \r\nMobile Check Deposit: Quickly and easily deposit checks from your mobile device\r\nFind an ATM: Easily locate one of more than 60,000 fee-free ATMs in the U.S near you\r\nAccount Information: View your statements, check balances and recent activity \r\nMake same-day or scheduled payments easily\r\n\r\nSmarter \r\nAggregation*: Link virtually all your bank accounts, credit cards and investment accounts for a more holistic financial view to managing your finances\r\nSpending insights*: Track your spending habits and trends across your accounts \r\nBill management*: View and manage your bills, and recurring payments in one place\r\nFICO® Score : Citi credit card customers can view their FICO® Score for free \r\nMake payments including automatic payments, and transfers and manage payees\r\nDispute credit card transactions if ever needed and track the status\r\nStay informed with Account Alerts: Choose the alerts you want and even when you want them\r\nChange your credit card due date: Choose the beginning, middle, or end of a month\r\nSecure \r\nCiti® Quick Lock: Lock or unlock your lost or misplaced card \r\nPIN Reset: Reset your debit card PIN from your mobile device\r\nEnable Fingerprint Authentication for a fast way to access your account\r\n* Features are available today on a limited basis.\r\n\r\n**Zelle and the Zelle related marks are wholly owned by Early Warning Services, LLC and are used herein under license.\r\n\r\nCiti’s Mobile App has been certified by J.D. Power for providing “An Outstanding Mobile Credit Card Experience” for customers.”\r\nJ.D. Power 2019 Mobile App Certification Program recognition is based on successful completion of an audit and exceeding a customer experience benchmark through a survey of recent servicing interactions. For more information, visit jdpower.com/awards.\r\n\r\nYour trust and confidence in how we collect, use, and share information about you is a priority. Review our privacy notice at  https://online.citi.com/JRS/portal/template.do?ID=Privacy and our notice at collection at https://online.citi.com/JRS/portal/template.do?ID=Privacy#notice-at-collection to learn more about privacy at Citi. Additionally, California residents may submit requests in connection with the California Consumer Privacy Act at https://online.citi.com/dataprivacyhub",
        "url": "https://play.google.com/store/apps/details?id=com.citi.citimobile",
        "score": 4.788591,
        "ratings": 0,
        "installs": "10,000,000+"
    }
]